eldarkg/emdr1986x-std-per-lib/CMSIS/CM4/DeviceSupport/MDR32F8/inc/MDR1986VE8T.h
/*
 *-----------------------------------------------------------------------------
 * The confidential and proprietary information contained in this file may
 * only be used by a person authorised under and to the extent permitted
 * by a subsisting licensing agreement from ARM Limited.
 *
 *            (C) COPYRIGHT 2009-2010 ARM Limited.
 *                ALL RIGHTS RESERVED
 *
 * This entire notice must be reproduced on all copies of this file
 * and copies of this file may only be made by a person if such person is
 * permitted to do so under the terms of a subsisting license agreement
 * from ARM Limited.
 *
 *      SVN Information
 *
 *
 *      Revision            : $Revision: 142008 $
 *
 *      Release information : cortexm4_r0p1_00rel0
 *-----------------------------------------------------------------------------
 */

#ifndef __MDR1986VE8T_H__
#define __MDR1986VE8T_H__

/*
 * ==========================================================================
 * ---------- Interrupt Number Definition -----------------------------------
 * ==========================================================================
 */

typedef enum IRQn
{
/******  Cortex-M4 Processor Exceptions Numbers ***************************************************/
  NonMaskableInt_IRQn         = -14,    /*!< 2 Non Maskable Interrupt                             */
  HardFault_IRQn              = -13,    /*!< 3 Cortex-M4 Hard Fault Interrupt                     */
  SVCall_IRQn                 = -5,     /*!< 11 Cortex-M4 SV Call Interrupt                       */
  PendSV_IRQn                 = -2,     /*!< 14 Cortex-M4 Pend SV Interrupt                       */
  SysTick_IRQn                = -1,     /*!< 15 Cortex-M4 System Tick Interrupt                   */

/******  CM4IKMCU Cortex-M4 specific Interrupt Numbers ********************************************/
                                       
  FT_IF0_IRQn             = 32,
  FT_IF1_IRQn             = 33,
  FT_IF2_IRQn             = 34,
  FT_IF3_IRQn             = 35,
  CLK_IF_IRQn             = 36,
  PVD_IF_IRQn             = 37,
  RTC_IF_IRQn             = 38,
  BKP_IF_IRQn             = 39,
  EXT_INTERROR0_IRQn      = 40,
  EXT_INTERROR1_IRQn      = 41,
  EXT_INTERROR2_IRQn      = 42,
  EXT_INTERROR3_IRQn      = 43,
  EXT_INTERROR4_IRQn      = 44,
  EXT_INTERROR5_IRQn      = 45,
  EXT_INTERROR6_IRQn      = 46,
  EXT_INTERROR7_IRQn      = 47,
  IF_ERR_SCR_IRQn         = 48,
  IF_FIN_SCR_IRQn         = 49,
  DMA_ERR_IRQn            = 50,
  
  DMA_DONE0_IRQn          = 51,
  DMA_DONE1_IRQn          = 52,
  DMA_DONE2_IRQn          = 53,
  DMA_DONE3_IRQn          = 54,
  DMA_DONE4_IRQn          = 55,
  DMA_DONE5_IRQn          = 56,
  DMA_DONE6_IRQn          = 57,
  DMA_DONE7_IRQn          = 58,
  DMA_DONE8_IRQn          = 59,
  DMA_DONE9_IRQn          = 60,
  DMA_DONE10_IRQn         = 61,
  DMA_DONE11_IRQn         = 62,
  DMA_DONE12_IRQn         = 63,
  DMA_DONE13_IRQn         = 64,
  DMA_DONE14_IRQn         = 65,
  DMA_DONE15_IRQn         = 66,  
  DMA_DONE16_IRQn         = 67,
  DMA_DONE17_IRQn         = 68,
  DMA_DONE18_IRQn         = 69,
  DMA_DONE19_IRQn         = 70,
  DMA_DONE20_IRQn         = 71,
  DMA_DONE21_IRQn         = 72,
  DMA_DONE22_IRQn         = 73,
  DMA_DONE23_IRQn         = 74,
  DMA_DONE24_IRQn         = 75,
  DMA_DONE25_IRQn         = 76,  
  DMA_DONE26_IRQn         = 77,
  DMA_DONE27_IRQn         = 78,
  DMA_DONE28_IRQn         = 79,
  DMA_DONE29_IRQn         = 80,
  DMA_DONE30_IRQn         = 81,
  DMA_DONE31_IRQn         = 82,
  
  PORTA_IRQn         		  = 83,
  PORTB_IRQn         		  = 84,
  PORTC_IRQn         		  = 85,
  PORTD_IRQn         		  = 86,
  PORTE_IRQn         		  = 87,
  PORTF_IRQn         		  = 88,	
  
  ETH0_IRQn         		  = 89,
  ETH1_IRQn         		  = 90,	
  SPW0_IRQn        			  = 91,
  SPW1_IRQn        			  = 92,
  
  TMR0_IRQn         			= 93,
  TMR1_IRQn         			= 94,
  TMR2_IRQn         			= 95,
  TMR3_IRQn         			= 96,
  TMR4_IRQn         			= 97,
  TMR5_IRQn         			= 98,
  
  CAN0_IRQn         			= 99,
  CAN1_IRQn         			= 100,
  CAN2_IRQn         			= 101,
  CAN3_IRQn         			= 102,
  CAN4_IRQn         			= 103,
  
	SSP0_IRQn         		  = 104,
  SSP1_IRQn         		  = 105,
  SSP2_IRQn         		  = 106,
  SSP3_IRQn         		  = 107,
  
  UART0_IRQn         		  = 108,	
  UART1_IRQn         		  = 109,	
  UART2_IRQn         		  = 110,	
  UART3_IRQn         		  = 111,
  
  USB_IRQn         		    = 112,
  
  ARC0_RX_IRQn         		= 113,
  ARC0_TX_IRQn        	 	= 114,	
  ARC1_RX_IRQn         		= 115,
  ARC1_TX_IRQn        	 	= 116,	  
  
  MIL0_IRQn         			= 117,
  MIL1_IRQn         			= 118,
  ADC0_IRQn         			= 119,
  ADC1_IRQn         			= 120,
  DAC0_IRQn         			= 121,
  DAC1_IRQn         			= 122,
  
  CRYPTO_IRQn       			= 123,
  CRC_IRQn       			    = 124,
  ECC_IRQn       			    = 125,
} IRQn_Type;


/*
 * ==========================================================================
 * ----------- Processor and Core Peripheral Section ------------------------
 * ==========================================================================
 */

/* Configuration of the Cortex-M4 Processor and Core Peripherals */
#define __MPU_PRESENT           1       /*!< cm4ikmcu does not provide a MPU present or not       */
#define __NVIC_PRIO_BITS        3       /*!< cm4ikmcu Supports 3 Bits for the Priority Levels     */
#define __Vendor_SysTickConfig  0       /*!< Set to 1 if different SysTick Config is used         */


#include "core_cm4.h"                   /* Cortex-M4 processor and core peripherals               */
//#include "system_cm4ikmcu.h"            /* cm4ikmcu System                                        */

/** @defgroup __Exported_types Exported types
  * @{
  */

typedef enum {RESET = 0, SET = !RESET} FlagStatus, ITStatus, BitStatus;

#define IS_BIT_STATUS(STATUS)	(((STATUS) == RESET) || ((STATE) == SET))

typedef enum {DISABLE = 0, ENABLE = !DISABLE} FunctionalState;
#define IS_FUNCTIONAL_STATE(STATE) (((STATE) == DISABLE) || ((STATE) == ENABLE))

typedef enum {ERROR = 0, SUCCESS = !ERROR} ErrorStatus;

/**
  * @}
  */ 	

/**
 * Initialize the system clock
 *
 * @param  none
 * @return none
 *
 * @brief  Setup the microcontroller system
 *         Initialize the PLL and update the SystemFrequency variable
 */
extern void SystemInit (void);


/******************************************************************************/
/*                Device Specific Peripheral registers structures             */
/******************************************************************************/

