eldarkg/emdr1986x-std-per-lib/CMSIS/CM4/DeviceSupport/MDR32F8/inc/MDR1986VE8T.h
/*--------------------- General Purpose Input and Ouptut ---------------------*/
typedef union
{
  __IO uint32_t WORD;
  __IO uint16_t HALFWORD[2];
  __IO uint8_t  BYTE[4];
} GPIO_Data_TypeDef;

typedef struct
{
  GPIO_Data_TypeDef DATA [256];
  GPIO_Data_TypeDef DIR;
  uint32_t RESERVED[3];
  GPIO_Data_TypeDef IE;
} GPIO_TypeDef;


/***
*  DMA control
**/
typedef struct
{
  __IO	uint32_t STATUS;
  __IO	uint32_t CONFIG;
  __IO	uint32_t CTRL_BASE_PTR;
  __IO	uint32_t ALT_CTRL_BASE_PTR;
  __IO	uint32_t WAITONREG_STATUS;
  __IO	uint32_t CHNL_SW_REQUEST;
  __IO	uint32_t CHNL_USEBURST_SET;
  __IO	uint32_t CHNL_USEBURST_CLR;
  __IO	uint32_t CHNL_REQ_MASK_SET;
  __IO	uint32_t CHNL_REQ_MASK_CLR;
  __IO	uint32_t CHNL_ENABLE_SET;
  __IO	uint32_t CHNL_ENABLE_CLR;
  __IO	uint32_t CHNL_PRI_ALT_SET;
  __IO	uint32_t CHNL_PRI_ALT_CLR;
  __IO	uint32_t CHNL_PRIORITY_SET;
  __IO	uint32_t CHNL_PRIORITY_CLR;
  uint32_t RESERVED[3];
  __IO	uint32_t ERR_CLR;
  __IO	uint32_t CHMUX0;
  __IO	uint32_t CHMUX1;
  __IO	uint32_t CHMUX2;
  __IO	uint32_t CHMUX3;
  __IO	uint32_t CHMUX4;
  __IO	uint32_t CHMUX5;
  __IO	uint32_t CHMUX6;
  __IO	uint32_t CHMUX7;
} DMAControl;

#define DMA_CNTR_BASE	    (( uint32_t) 0xe0042000)

#define	MDR_DMA		    ((DMAControl *) DMA_CNTR_BASE)

/** @defgroup MDR1986VE8T_Periph_DMA_Defines Defines
  * @{
  */

/** @defgroup MDR1986VE8T_DMA_STATUS	DMA STATUS
  * @{
  */ 

/*-- DMA_STATUS: DMA Status Register -------------------------------*/
/* Bit field positions: */
#define DMA_STATUS_MASTER_ENABLE_Pos            0
#define DMA_STATUS_STATE_Pos                    4
#define DMA_STATUS_CHNLS_MINUS1_Pos             16
#define DMA_STATUS_TEST_STATUS_Pos              28

/* Bit field masks: */
#define DMA_STATUS_MASTER_ENABLE                ((uint32_t)0x00000001)
#define DMA_STATUS_STATE_Msk                    ((uint32_t)0x000000F0)
#define DMA_STATUS_CHNLS_MINUS1_Msk             ((uint32_t)0x001F0000)
#define DMA_STATUS_TEST_STATUS_Msk              ((uint32_t)0xF0000000)

/** @} */ /* End of group DMA_STATUS */

/** @defgroup MDR1986VE8T_DMA_CFG	DMA CFG
  * @{
  */ 

/*-- DMA_CFG: DMA Configuration Register ---------------------------*/
/* Bit field positions: */
#define DMA_CFG_MASTER_ENABLE_Pos               0
#define DMA_CFG_CHNL_PROT_CTRL_Pos              5

/* Bit field masks: */
#define DMA_CFG_MASTER_ENABLE                   ((uint32_t)0x00000001)
#define DMA_CFG_CHNL_PROT_CTRL_Msk              ((uint32_t)0x000000E0)

/** @} */ /* End of group DMA_CFG */

/** @} */ /* End of group MDR1986VE8T_Periph_DMA_Defines */

/***
*  DMA Primary data structure
**/

typedef struct
{
  __IO	uint32_t PRIMARY_CH0_SOURCE_END_POINTER;
  __IO	uint32_t PRIMARY_CH0_DEST_END_POINTER;
  __IO	uint32_t PRIMARY_CH0_CONTROL;
  __IO	uint32_t PRIMARY_CH0_UNUSED;
 
  __IO	uint32_t PRIMARY_CH1_SOURCE_END_POINTER;
  __IO	uint32_t PRIMARY_CH1_DEST_END_POINTER;
  __IO	uint32_t PRIMARY_CH1_CONTROL;
  __IO	uint32_t PRIMARY_CH1_UNUSED;

  __IO	uint32_t PRIMARY_CH2_SOURCE_END_POINTER;
  __IO	uint32_t PRIMARY_CH2_DEST_END_POINTER;
  __IO	uint32_t PRIMARY_CH2_CONTROL;
  __IO	uint32_t PRIMARY_CH2_UNUSED;
 
  __IO	uint32_t PRIMARY_CH3_SOURCE_END_POINTER;
  __IO	uint32_t PRIMARY_CH3_DEST_END_POINTER;
  __IO	uint32_t PRIMARY_CH3_CONTROL;
  __IO	uint32_t PRIMARY_CH3_UNUSED;

  __IO	uint32_t PRIMARY_CH4_SOURCE_END_POINTER;
  __IO	uint32_t PRIMARY_CH4_DEST_END_POINTER;
  __IO	uint32_t PRIMARY_CH4_CONTROL;
  __IO	uint32_t PRIMARY_CH4_UNUSED;
 
  __IO	uint32_t PRIMARY_CH5_SOURCE_END_POINTER;
  __IO	uint32_t PRIMARY_CH5_DEST_END_POINTER;
  __IO	uint32_t PRIMARY_CH5_CONTROL;
  __IO	uint32_t PRIMARY_CH5_UNUSED;

  __IO	uint32_t PRIMARY_CH6_SOURCE_END_POINTER;
  __IO	uint32_t PRIMARY_CH6_DEST_END_POINTER;
  __IO	uint32_t PRIMARY_CH6_CONTROL;
  __IO	uint32_t PRIMARY_CH6_UNUSED;
 
  __IO	uint32_t PRIMARY_CH7_SOURCE_END_POINTER;
  __IO	uint32_t PRIMARY_CH7_DEST_END_POINTER;
  __IO	uint32_t PRIMARY_CH7_CONTROL;
  __IO	uint32_t PRIMARY_CH7_UNUSED;

  __IO	uint32_t PRIMARY_CH8_SOURCE_END_POINTER;
  __IO	uint32_t PRIMARY_CH8_DEST_END_POINTER;
  __IO	uint32_t PRIMARY_CH8_CONTROL;
  __IO	uint32_t PRIMARY_CH8_UNUSED;
 
  __IO	uint32_t PRIMARY_CH9_SOURCE_END_POINTER;
  __IO	uint32_t PRIMARY_CH9_DEST_END_POINTER;
  __IO	uint32_t PRIMARY_CH9_CONTROL;
  __IO	uint32_t PRIMARY_CH9_UNUSED;

  __IO	uint32_t PRIMARY_CH10_SOURCE_END_POINTER;
  __IO	uint32_t PRIMARY_CH10_DEST_END_POINTER;
  __IO	uint32_t PRIMARY_CH10_CONTROL;
  __IO	uint32_t PRIMARY_CH10_UNUSED;
 
  __IO	uint32_t PRIMARY_CH11_SOURCE_END_POINTER;
  __IO	uint32_t PRIMARY_CH11_DEST_END_POINTER;
  __IO	uint32_t PRIMARY_CH11_CONTROL;
  __IO	uint32_t PRIMARY_CH11_UNUSED;

  __IO	uint32_t PRIMARY_CH12_SOURCE_END_POINTER;
  __IO	uint32_t PRIMARY_CH12_DEST_END_POINTER;
  __IO	uint32_t PRIMARY_CH12_CONTROL;
  __IO	uint32_t PRIMARY_CH12_UNUSED;
 
  __IO	uint32_t PRIMARY_CH13_SOURCE_END_POINTER;
  __IO	uint32_t PRIMARY_CH13_DEST_END_POINTER;
  __IO	uint32_t PRIMARY_CH13_CONTROL;
  __IO	uint32_t PRIMARY_CH13_UNUSED;

  __IO	uint32_t PRIMARY_CH14_SOURCE_END_POINTER;
  __IO	uint32_t PRIMARY_CH14_DEST_END_POINTER;
  __IO	uint32_t PRIMARY_CH14_CONTROL;
  __IO	uint32_t PRIMARY_CH14_UNUSED;
 
  __IO	uint32_t PRIMARY_CH15_SOURCE_END_POINTER;
  __IO	uint32_t PRIMARY_CH15_DEST_END_POINTER;
  __IO	uint32_t PRIMARY_CH15_CONTROL;
  __IO	uint32_t PRIMARY_CH15_UNUSED;

  __IO	uint32_t PRIMARY_CH16_SOURCE_END_POINTER;
  __IO	uint32_t PRIMARY_CH16_DEST_END_POINTER;
  __IO	uint32_t PRIMARY_CH16_CONTROL;
  __IO	uint32_t PRIMARY_CH16_UNUSED;
 
  __IO	uint32_t PRIMARY_CH17_SOURCE_END_POINTER;
  __IO	uint32_t PRIMARY_CH17_DEST_END_POINTER;
  __IO	uint32_t PRIMARY_CH17_CONTROL;
  __IO	uint32_t PRIMARY_CH17_UNUSED;

  __IO	uint32_t PRIMARY_CH18_SOURCE_END_POINTER;
  __IO	uint32_t PRIMARY_CH18_DEST_END_POINTER;
  __IO	uint32_t PRIMARY_CH18_CONTROL;
  __IO	uint32_t PRIMARY_CH18_UNUSED;
 
  __IO	uint32_t PRIMARY_CH19_SOURCE_END_POINTER;
  __IO	uint32_t PRIMARY_CH19_DEST_END_POINTER;
  __IO	uint32_t PRIMARY_CH19_CONTROL;
  __IO	uint32_t PRIMARY_CH19_UNUSED;

  __IO	uint32_t PRIMARY_CH20_SOURCE_END_POINTER;
  __IO	uint32_t PRIMARY_CH20_DEST_END_POINTER;
  __IO	uint32_t PRIMARY_CH20_CONTROL;
  __IO	uint32_t PRIMARY_CH20_UNUSED;
 
  __IO	uint32_t PRIMARY_CH21_SOURCE_END_POINTER;
  __IO	uint32_t PRIMARY_CH21_DEST_END_POINTER;
  __IO	uint32_t PRIMARY_CH21_CONTROL;
  __IO	uint32_t PRIMARY_CH21_UNUSED;

