eldarkg/emdr1986x-std-per-lib/CMSIS/CM4/DeviceSupport/MDR32F8/inc/MDR1986VE8T.h
  __IO	uint32_t ALTER_CH26_SOURCE_END_POINTER;
  __IO	uint32_t ALTER_CH26_DEST_END_POINTER;
  __IO	uint32_t ALTER_CH26_CONTROL;
  __IO	uint32_t ALTER_CH26_UNUSED;
 
  __IO	uint32_t ALTER_CH27_SOURCE_END_POINTER;
  __IO	uint32_t ALTER_CH27_DEST_END_POINTER;
  __IO	uint32_t ALTER_CH27_CONTROL;
  __IO	uint32_t ALTER_CH27_UNUSED;

  __IO	uint32_t ALTER_CH28_SOURCE_END_POINTER;
  __IO	uint32_t ALTER_CH28_DEST_END_POINTER;
  __IO	uint32_t ALTER_CH28_CONTROL;
  __IO	uint32_t ALTER_CH28_UNUSED;
 
  __IO	uint32_t ALTER_CH29_SOURCE_END_POINTER;
  __IO	uint32_t ALTER_CH29_DEST_END_POINTER;
  __IO	uint32_t ALTER_CH29_CONTROL;
  __IO	uint32_t ALTER_CH29_UNUSED;

  __IO	uint32_t ALTER_CH30_SOURCE_END_POINTER;
  __IO	uint32_t ALTER_CH30_DEST_END_POINTER;
  __IO	uint32_t ALTER_CH30_CONTROL;
  __IO	uint32_t ALTER_CH30_UNUSED;
 
  __IO	uint32_t ALTER_CH31_SOURCE_END_POINTER;
  __IO	uint32_t ALTER_CH31_DEST_END_POINTER;
  __IO	uint32_t ALTER_CH31_CONTROL;
  __IO	uint32_t ALTER_CH31_UNUSED;
} DMA_AlterData_TypeDef;
/***

*  Cache control
**/
typedef struct
{
  __IO	uint32_t KEY;
  __IO	uint32_t CNTL;
  __I	uint32_t HIT_CNT;
  __I	uint32_t MISS_CNT;
  uint32_t RESERVED[4];
  __IO	uint32_t ECC_CNTL;
  __IO	uint32_t ECC_ADDR;
  __IO	uint32_t ECC_DATA;
  __IO	uint32_t ECC_ECC;
} CacheControl;

#define ICACHE_BASE	    (( uint32_t) 0xe0044000)
#define DCACHE_BASE	    (( uint32_t) 0xe0045000)

#define	ICACHE		    ((CacheControl *) ICACHE_BASE)
#define DCACHE		    ((CacheControl *) DCACHE_BASE)

#define CC_CACHE_ENABLE ((uint32_t) 0x1)
#define CC_CACHE_CLR	((uint32_t) (1<<1))
#define CC_OTP_ENABLE	((uint32_t) (1<<2))
#define CC_EXTB_ENABLE	((uint32_t) (1<<3))
#define CC_HIT_CLR	((uint32_t) (1<<4))
#define CC_MISS_CLR	((uint32_t) (1<<5))

#define CC_KEY			((uint32_t) 0x8555aaa1)

/***
*  SCRABER control
**/
typedef struct
{
  __IO	uint32_t CNTRL;
  __IO	uint32_t S_ADDR;
  __IO	uint32_t F_ADDR;
  __IO	uint32_t DATA;
  __IO	uint32_t SECC;
} SCRControl;

#define SCR_CNTR_BASE	    (( uint32_t) 0xe0043000)

#define	SCR_CNTR	    ((SCRControl *) SCR_CNTR_BASE)

/***
*  FT control
**/
typedef struct
{
  __IO	uint32_t KEY;
  __IO	uint32_t CONTROL;
  __IO	uint32_t STATUS;
  __IO	uint32_t TIMEOUT;
  __IO	uint32_t TICKCNT;
  __IO	uint32_t FIRSTEVENT;
  __IO	uint32_t LASTEVENT;
  __IO	uint32_t TIMEOUTCNT;
  __IO	uint32_t EVENT[13];
  __IO	uint32_t RESET_EVENT0;
  __IO	uint32_t RESET_EVENT1;
  __IO	uint32_t RESET_EVENT2;
  __IO	uint32_t RESET_EVENT3;
  __IO	uint32_t RESET_EVENT4;
  __IO	uint32_t IE_EVENT5;
  __IO	uint32_t IE_EVENT6;
  __IO	uint32_t IE_EVENT7;
  __IO	uint32_t IE_EVENT8;
  __IO	uint32_t IE_EVENT9;
  __IO	uint32_t IE_EVENT10;
  __IO	uint32_t IE_EVENT11;
  __IO	uint32_t IE_EVENT12;
  __IO	uint32_t FT_STAT0;
  __IO	uint32_t FT_STAT1;
} FTControl;

#define FT_CNTR_BASE	    (( uint32_t) 0x40003000)

#define	FT_CNTR		    ((FTControl *) FT_CNTR_BASE)


/***
*  OTP control
**/

typedef struct
{
  __IO	uint32_t KEY;
  __IO	uint32_t CNTR;
  __IO	uint32_t ADR;
  __IO	uint32_t WDATA;
  __IO	uint32_t RDATA;
  __IO	uint32_t ECCCS;
  __IO	uint32_t ECCADR;
  __IO	uint32_t ECCDATA;
  __IO	uint32_t ECCECC;
  __IO	uint32_t TEST_TUNING;
} OTPControl;


#define OTP_CNTR_BASE	    (( uint32_t) 0x40006000)

#define	OTP_CNTR	    ((OTPControl *) OTP_CNTR_BASE)
#define OTP_CNTR_WS	    ((uint32_t) 0x7)

/***
*  ROM,RAMC,RAMD control
**/

typedef struct
{
  __IO	uint32_t KEY;
  __IO	uint32_t ECCCS;
  __IO	uint32_t ECCADR;
  __IO	uint32_t ECCDATA;
  __IO	uint32_t ECCECC;
  __IO	uint32_t TEST_TUNING;
} MEMControl;


#define ROM_CNTR_BASE	    (( uint32_t) 0x40009000)
#define RAMC_CNTR_BASE	    (( uint32_t) 0x40007000)
#define RAMD_CNTR_BASE	    (( uint32_t) 0x40008000)

#define	ROM_CNTR	    ((MEMControl *) ROM_CNTR_BASE)
#define	RAMC_CNTR	    ((MEMControl *) RAMC_CNTR_BASE)
#define	RAMD_CNTR	    ((MEMControl *) RAMD_CNTR_BASE)

#define RCACHE_BASE	    (( uint32_t) 0x4000b000)
#define RCACHE		    ((CacheControl *) RCACHE_BASE)
/***
*  EXTBUS control
**/
typedef struct
{
  __IO	uint32_t KEY;
  __IO	uint32_t RGN0_CNTRL;
  __IO	uint32_t RGN1_CNTRL;
  __IO	uint32_t RGN2_CNTRL;
  __IO	uint32_t RGN3_CNTRL;
  __IO	uint32_t RGN4_CNTRL;
  __IO	uint32_t RGN5_CNTRL;
  __IO	uint32_t RGN6_CNTRL;
  __IO	uint32_t RGN7_CNTRL;
  
  __IO	uint32_t RGN0_ECCBASE;
  __IO	uint32_t RGN1_ECCBASE;
  __IO	uint32_t RGN2_ECCBASE;
  __IO	uint32_t RGN3_ECCBASE;
  __IO	uint32_t RGN4_ECCBASE;
  __IO	uint32_t RGN5_ECCBASE;
  __IO	uint32_t RGN6_ECCBASE;
  __IO	uint32_t RGN7_ECCBASE;
  
  __IO	uint32_t RGN0_ECCS;
  __IO	uint32_t RGN1_ECCS;
  __IO	uint32_t RGN2_ECCS;
  __IO	uint32_t RGN3_ECCS;
  __IO	uint32_t RGN4_ECCS;
  __IO	uint32_t RGN5_ECCS;
  __IO	uint32_t RGN6_ECCS;
  __IO	uint32_t RGN7_ECCS;
  

  __IO	uint32_t SPORT_PWR0;
  __IO	uint32_t SPORT_PWR1;
  __IO	uint32_t SPORT_PWR2;
  __IO	uint32_t SPORT_PWR3;
  
  __IO	uint32_t SPORT_PD0;
  __IO	uint32_t SPORT_PD1;
  __IO	uint32_t SPORT_PD2;
  __IO	uint32_t SPORT_PD3;

  __IO	uint32_t SPORT_CL0;
  __IO	uint32_t SPORT_CL1;
  __IO	uint32_t SPORT_CL2;
  __IO	uint32_t SPORT_CL3;
  
  __IO	uint32_t ECC_ADDR;
  __IO	uint32_t ECC_DATA;
  __IO	uint32_t ECC_ECC;
  
} EXTBUSControl;

#define EXT_BUS_CNTR_BASE	    (( uint32_t) 0x40005000)

#define	EXT_BUS_CNTR		    ((EXTBUSControl *) EXT_BUS_CNTR_BASE)

#define EB_CNTR_MODE(mode)  ((mode & 3) << 4)
#define EB_CNTR_ECCMODE	    4
#define EB_CNTR_ECCEN	    2
#define EB_CNTR_EN	    1
#define EB_CNTR_WS_HOLD(hold)  ((hold & 0xf) << 20)
#define EB_CNTR_WS_ACTIVE(act) ((act & 0xf) << 16)
#define EB_CNTR_WS_SETUP(setup) ((setup & 0xff) << 8)

#define EBC_ECCEN_pos							1
#define EBC_ECCMODE_pos						2
#define EBC_RDYWAIT_pos						3
#define EBC_MODE_pos							4
#define EBC_ROM_pos								6
#define EBC_CPOL_pos							7
#define EBC_WS_ACTIVE_pos					8
#define EBC_WS_SETUP_pos					16
#define EBC_WS_HOLD_pos						20
#define EBC_USESEPAR_pos					24
#define EBC_CACHEBLE_pos					25
#define EBC_READ32_pos						26
#define EBC_ENOCLK_pos						27
#define EBC_DIVOCLK_pos						28

#define EBC_ECCEN_MSK							((uint32_t) 0x00000002)
#define EBC_ECCMODE_MSK						((uint32_t) 0x00000004)
#define EBC_RDYWAIT_MSK						((uint32_t) 0x00000008)
#define EBC_MODE_MSK							((uint32_t) 0x00000030)
#define EBC_ROM_MSK								((uint32_t) 0x00000040)
#define EBC_CPOL_MSK							((uint32_t) 0x00000080)
#define EBC_WS_ACTIVE_MSK					((uint32_t) 0x0000FF00)
#define EBC_WS_SETUP_MSK					((uint32_t) 0x000F0000)
#define EBC_WS_HOLD_MSK						((uint32_t) 0x00F00000)
#define EBC_USESEPAR_MSK					((uint32_t) 0x01000000)
#define EBC_CACHEBLE_MSK					((uint32_t) 0x02000000)
#define EBC_READ32_MSK						((uint32_t) 0x04000000)
#define EBC_ENOCLK_MSK						((uint32_t) 0x08000000)
#define EBC_DIVOCLK_MSK						((uint32_t) 0xF0000000)

