eldarkg/emdr1986x-std-per-lib/CMSIS/CM4/DeviceSupport/MDR32F8/inc/MDR1986VE8T.h
/***
*  PWR control
**/

typedef struct
{
  __IO	uint32_t KEY;
  
  __IO	uint32_t CNTR0;
  __IO	uint32_t CNTR1;
  __IO	uint32_t CNTR2;
  
  __IO	uint32_t STAT;

  __IO	uint32_t ULIMIT;
  __IO	uint32_t CLIMIT;
 
} PWRControl;


#define PWR_BASE	    (( uint32_t) 0x40002000)
#define	PWR	 	    ((PWRControl *) PWR_BASE)

/***
*  WDT control
**/


typedef struct
{
  __IO	uint32_t KEY;
  __IO	uint32_t PRL;
  __IO	uint32_t EN;
  __IO	uint32_t CNT;
 
} WDTControl;


#define WDT_BASE	    (( uint32_t) 0x40004000)
#define	WDT	 	    ((WDTControl *) WDT_BASE)

/***
*  ADCx control
**/

typedef struct
{
  __IO	uint32_t KEY;
  
  __IO	uint32_t CONFIG0;
  __IO	uint32_t CONFIG1;
  __IO	uint32_t CONFIG2;
  __IO	uint32_t CONTROL;
  __IO	uint32_t STATUS;

  __IO	uint32_t RESULT;
  __IO	uint32_t RESULTCH_xx[64];

  __IO	uint32_t MAX_LEVEL;
  __IO	uint32_t MIN_LEVEL;

  __IO	uint32_t CHSEL0;
  __IO	uint32_t CHSEL1;

  __IO	uint32_t DMAREQ;
  __IO	uint32_t STATRCH0;
  __IO	uint32_t STATRCH1;
  
  __IO	uint32_t FIFOEN0;
  __IO	uint32_t FIFOEN1;
 
} ADCxControl;


#define ADC0_BASE	    (( uint32_t) 0x400AA000)

#define	ADC0	 	    ((ADCxControl *) ADC0_BASE)

#define ADC1_BASE	    (( uint32_t) 0x400AB000)

#define	ADC1	 	    ((ADCxControl *) ADC1_BASE)

/** @defgroup MDR1986VE8T_ADC_Defines Defines
  * @{
  */

/** @defgroup MDR1986VE8T_ADC1_CFG	ADC1 CFG
  * @{
  */ 

/*-- CONFIG0: ADCx Configuration Register -------------------------*/
/* Bit field positions: */
#define ADCx_CONFIG0_ADCEN_Pos                  0
#define ADCx_CONFIG0_WORKMODE_Pos               1
#define ADCx_CONFIG0_REFMODE_Pos               	3
#define ADCx_CONFIG0_RH_MODE_Pos               	4
#define ADCx_CONFIG0_SELMODE_Pos                5
#define ADCx_CONFIG0_EXT_GO_INV_Pos             7
#define ADCx_CONFIG0_EXT_GO_SEL_Pos             8

/* Bit field masks: */
#define ADCx_CONFIG0_ADCEN               		((uint32_t)0x00000001)
#define ADCx_CONFIG0_WORKMODE               ((uint32_t)0x00000006)
#define ADCx_CONFIG0_REFMODE               	((uint32_t)0x00000008)
#define ADCx_CONFIG0_RH_MODE               	((uint32_t)0x00000010)
#define ADCx_CONFIG0_SELMODE                ((uint32_t)0x00000020)
#define ADCx_CONFIG0_EXT_GO_INV             ((uint32_t)0x00000080)
#define ADCx_CONFIG0_EXT_GO_SEL             ((uint32_t)0xFFFFFF00)

/** @} */ /* End of group CONFIG0 */

/*-- CONFIG1: ADCx Configuration Register -------------------------*/
/* Bit field positions: */
#define ADCx_CONFIG1_REFTRIM_Pos               0
#define ADCx_CONFIG1_SETUP_Pos               	 3
#define ADCx_CONFIG1_PAUSE_Pos               	 12
#define ADCx_CONFIG1_ADCTRIM_Pos               20

/* Bit field masks: */
#define ADCx_CONFIG1_REFTRIM               ((uint32_t)0x00000007)
#define ADCx_CONFIG1_SETUP               	 ((uint32_t)0x00000FF8)
#define ADCx_CONFIG1_PAUSE               	 ((uint32_t)0x000FF000)
#define ADCx_CONFIG1_ADCTRIM               ((uint32_t)0xFFF00000)

/** @} */ /* End of group CONFIG1 */

/*-- CONFIG2: ADCx Configuration Register -------------------------*/
/* Bit field positions: */
#define ADCx_CONFIG2_IE_NE_Pos               0
#define ADCx_CONFIG2_IE_OF_Pos               1
#define ADCx_CONFIG2_IE_NAE_Pos              2
#define ADCx_CONFIG2_IE_AF_Pos               3
#define ADCx_CONFIG2_IE_ERFIN_Pos            4
#define ADCx_CONFIG2_LEVLCNTRL_Pos           6
#define ADCx_CONFIG2_REFSEL_Pos              8
#define ADCx_CONFIG2_REFTRIMR_Pos            16
#define ADCx_CONFIG2_DT_MODE_Pos             24

/* Bit field masks: */
#define ADCx_CONFIG2_IE_NE               ((uint32_t)0x00000001)
#define ADCx_CONFIG2_IE_OF               ((uint32_t)0x00000002)
#define ADCx_CONFIG2_IE_NAE              ((uint32_t)0x00000004)
#define ADCx_CONFIG2_IE_AF               ((uint32_t)0x00000008)
#define ADCx_CONFIG2_IE_ERFIN            ((uint32_t)0x00000010)
#define ADCx_CONFIG2_LEVLCNTRL           ((uint32_t)0x000000C0)
#define ADCx_CONFIG2_REFSEL              ((uint32_t)0x0000FF00)
#define ADCx_CONFIG2_REFTRIMR            ((uint32_t)0x00FF0000)
#define ADCx_CONFIG2_DT_MODE             ((uint32_t)0x01000000)

/** @} */ /* End of group CONFIG2 */

/** @} */ /* End of group Periph_ADC_Defines */

/** @} */ /* End of group Periph_ADC */

/***
*  DACx control
**/

typedef struct
{
  __IO	uint32_t KEY;
  
  __IO	uint32_t CONFIG0;
  __IO	uint32_t CONFIG1;

  __IO	uint32_t DATA;

  __IO	uint32_t STATUS;
  __IO	uint32_t IMSK;
  __IO	uint32_t DMAREQ;
 
} DACxControl;


#define DAC0_BASE	    (( uint32_t) 0x400AC000)

#define	DAC0	 	    ((DACxControl *) DAC0_BASE)

#define DAC1_BASE	    (( uint32_t) 0x400AD000)

#define	DAC1	 	    ((DACxControl *) DAC1_BASE)

/** @defgroup MDR1986VE8T_Periph_DAC_Defines Defines
  * @{
  */

/** @defgroup Periph_DAC_CFG	DAC CFG
  * @{
  */ 

/*-- DAC_CFG: DAC Configuration Register ---------------------------*/
/* Bit field positions: */
#define DAC_CONFIG0_M_REF_Pos                   2
#define DAC_CONFIG0_SYNC_A_Pos                  1
#define DAC_CONFIG0_ON_DAC_Pos                  0


/* Bit field masks: */
#define DAC_CONFIG0_M_REF                   ((uint32_t) 0x0000000C)
#define DAC_CONFIG0_SYNC_A                  ((uint32_t) 0x00000002)
#define DAC_CONFIG0_ON_DAC                  ((uint32_t) 0x00000001)

/** @} */ /* End of group DAC_CFG */

/** @defgroup Periph_DAC_DATA	DAC DATA
  * @{
  */ 

/*-- DAC1_DATA: DAC1 Data Register ---------------------------------*/
/* Bit field masks: */
#define DAC_DATA_Msk                  			 ((uint32_t)0x00000FFF)

/** @} */ /* End of group DAC_DATA */

/** @} */ /* End of group MDR1986VE8T_Periph_DAC_Defines */

/***
*  CRC control
**/

typedef struct
{
  __IO	uint32_t KEY;
  __IO	uint32_t CTRL;
  __IO	uint32_t STAT;
  __IO	uint32_t DIN;
  __IO	uint32_t VALL;
  __IO	uint32_t VALH;
  __IO	uint32_t POLL;
  __IO	uint32_t POLH;
  __IO	uint32_t FINXORL;
  __IO	uint32_t FINXORH;
  __IO	uint32_t CNTFLOW;
} CRC_Control;

#define CRC_BASE	    (( uint32_t) 0x400AF000)

#define	CRC	 	    ((CRC_Control *) CRC_BASE)


/***
*  ECC control
**/

typedef struct
{
  __IO	uint32_t KEY;
  __IO	uint32_t CTRL;
  __IO	uint32_t STAT;
  __IO	uint32_t DATIL;
  __IO	uint32_t DATIH;
  __IO	uint32_t ECCI;
  __IO	uint32_t DLER;
  __IO	uint32_t DHER;
  __IO	uint32_t ECER;
  __IO	uint32_t DATOL;
  __IO	uint32_t DATOH;
  __IO	uint32_t ECCO;
  __IO	uint32_t H000;
  __IO	uint32_t H032;
  __IO	uint32_t H100;
  __IO	uint32_t H132;
  __IO	uint32_t H200;
  __IO	uint32_t H232;
  __IO	uint32_t H300;
  __IO	uint32_t H332;
  __IO	uint32_t H400;
  __IO	uint32_t H432;
  __IO	uint32_t H500;
  __IO	uint32_t H532;
  __IO	uint32_t H600;
  __IO	uint32_t H632;
  __IO	uint32_t H700;
  __IO	uint32_t H732;
  
