eldarkg/emdr1986x-std-per-lib/CMSIS/CM4/DeviceSupport/MDR32F8/inc/MDR1986VE8T.h
} ECC_Control;

#define ECC_BASE	    (( uint32_t) 0x400B0000)

#define	ECC 	    ((ECC_Control *) ECC_BASE)


/***
*  BKP control
**/

typedef struct
{
  __IO	uint32_t REG_xx[60];
  __IO	uint32_t KEY;
  __IO	uint32_t RESERV_0[3];
  
  __IO	uint32_t REG_60_TMR0;
  __IO	uint32_t REG_61_TMR0;
  __IO	uint32_t REG_62_TMR0;
  __IO	uint32_t REG_63_TMR0
  ;
  __IO	uint32_t REG_60_TMR1;
  __IO	uint32_t REG_61_TMR1;
  __IO	uint32_t REG_62_TMR1;
  __IO	uint32_t REG_63_TMR1;
  
  __IO	uint32_t REG_60_TMR2;
  __IO	uint32_t REG_61_TMR2;
  __IO	uint32_t REG_62_TMR2;
  __IO	uint32_t REG_63_TMR2;
  
  __IO	uint32_t RTC_CNT_TMR0;
  __IO	uint32_t RTC_DIV_TMR0;
  __IO	uint32_t RTC_PRL_TMR0;
  __IO	uint32_t RTC_ALRM_TMR0;
  __IO	uint32_t RTC_CS_TMR0;
  
  __IO	uint32_t RESERV_1[3];

  __IO	uint32_t RTC_CNT_TMR1;
  __IO	uint32_t RTC_DIV_TMR1;
  __IO	uint32_t RTC_PRL_TMR1;
  __IO	uint32_t RTC_ALRM_TMR1;
  __IO	uint32_t RTC_CS_TMR1;
  
  __IO	uint32_t RESERV_2[3];

  __IO	uint32_t RTC_CNT_TMR2;
  __IO	uint32_t RTC_DIV_TMR2;
  __IO	uint32_t RTC_PRL_TMR2;
  __IO	uint32_t RTC_ALRM_TMR2;
  __IO	uint32_t RTC_CS_TMR2;
  
  
} BKPControl;


#define BKP_BASE	    (( uint32_t) 0x40001000)

#define	BKP		    ((BKPControl *) BKP_BASE)
#define BKP_KEY 	    ((uint32_t)	0x8555aaa1)

/***
*  CRYPTO control
**/

typedef struct
{
  __IO	uint32_t CRPT_CWR;
  __IO	uint32_t CRPT_SR;
  __IO	uint32_t CRPT_DATA;
  __IO	uint32_t CRPT_KR;
  __IO	uint32_t CRPT_CR;
  __IO	uint32_t CRPT_SYNR;
  __IO	uint32_t CRPT_IMIT;
  __IO	uint32_t CRPT_ITER;
} CRPTControl;


#define CRPT_BASE	    (( uint32_t) 0x400AE000)

#define	CRPT		    ((CRPTControl *) CRPT_BASE)

/***
*   MIL1553 Control 
**/

typedef struct
{
  __IO	uint32_t DATA[1024];
  __IO	uint32_t CONTROL;
  __IO	uint32_t STATUS;
  __IO	uint32_t ERROR;
  __IO	uint32_t CommandWord1;
  __IO	uint32_t CommandWord2;
  __IO	uint32_t ModeData;
  __IO	uint32_t StatusWord1;
  __IO	uint32_t StatusWord2;
  __IO	uint32_t INTEN;
  __IO	uint32_t MSG;
} MIL1553Control;


#define MIL15531_BASE	    (( uint32_t) 0x400A6000)
#define MIL15532_BASE	    (( uint32_t) 0x400A8000)

#define	MIL_STD_15531	    ((MIL1553Control *) MIL15531_BASE)
#define	MIL_STD_15532	    ((MIL1553Control *) MIL15532_BASE)

/** @defgroup MDR1986VE8T_Periph_MIL_STD_1553_Defines Defines
  * @{
  */
/** @defgroup MDR1986VE8T_Periph_MIL_STD_1553_CONTROL	MIL STD 1553 CONTROL
  * @{
  */ 

/*-- MIL_STD_1553_CONTROL: MIL_STD_1553 Control Register -----*/
/* Bit field positions: */
#define MIL_STD_1553_CONTROL_MR_Pos            0
#define MIL_STD_1553_CONTROL_BCSTART_Pos       1
#define MIL_STD_1553_CONTROL_BCMODE_Pos        2
#define MIL_STD_1553_CONTROL_RTMODE_Pos        3
#define MIL_STD_1553_CONTROL_TRA_Pos           4
#define MIL_STD_1553_CONTROL_TRB_Pos           5
#define MIL_STD_1553_CONTROL_RTA_Pos           6
#define MIL_STD_1553_CONTROL_DIV_Pos           11
#define MIL_STD_1553_CONTROL_RERR_Pos          18
#define MIL_STD_1553_CONTROL_INVTR_Pos		   19
#define MIL_STD_1553_CONTROL_ENFILTER_Pos	   20
#define MIL_STD_1553_CONTROL_AUTOTUNE_Pos	   21

/* Bit field masks: */
#define MIL_STD_1553_CONTROL_MR                 ((uint32_t)0x00000001)
#define MIL_STD_1553_CONTROL_BCSTART            ((uint32_t)0x00000002)
#define MIL_STD_1553_CONTROL_BCMODE			    ((uint32_t)0x00000004)
#define MIL_STD_1553_CONTROL_RTMODE             ((uint32_t)0x00000008)
#define MIL_STD_1553_CONTROL_TRA                ((uint32_t)0x00000010)
#define MIL_STD_1553_CONTROL_TRB                ((uint32_t)0x00000020)
#define MIL_STD_1553_CONTROL_RTA_Msk            ((uint32_t)0x000007C0)
#define MIL_STD_1553_CONTROL_DIV_Msk            ((uint32_t)0x0003F800)
#define MIL_STD_1553_CONTROL_RERR               ((uint32_t)0x00040000)
#define MIL_STD_1553_CONTROL_INVTR				((uint32_t)0x00080000)
#define MIL_STD_1553_CONTROL_ENFILTER		    ((uint32_t)0x00100000)
#define MIL_STD_1553_CONTROL_AUTOTUNE		    ((uint32_t)0x00200000)

/** @} */ /* End of group MIL_STD_1553_CONTROL */


/** @defgroup MDR1986VE8T_Periph_MIL_STD_1553_STATUS	MIL STD 1553 STATUS
  * @{
  */ 

/*-- MIL_STD_1553_STATUS: MIL_STD_1553 Status Register -----*/
/* Bit field positions: */
#define MIL_STD_1553_STATUS_IDLE_Pos            	 0
#define MIL_STD_1553_STATUS_RFLAGN_Pos            	 1
#define MIL_STD_1553_STATUS_VALMESS_Pos            	 2
#define MIL_STD_1553_STATUS_ERR_Pos	            	 3
#define MIL_STD_1553_STATUS_RCVA_Pos            	 4
#define MIL_STD_1553_STATUS_RCVB_Pos            	 5

/* Bit field masks: */
#define MIL_STD_1553_STATUS_IDLE            		 ((uint32_t)0x00000001)
#define MIL_STD_1553_STATUS_RFLAGN          	  	 ((uint32_t)0x00000002)
#define MIL_STD_1553_STATUS_VALMESS     	       	 ((uint32_t)0x00000004)
#define MIL_STD_1553_STATUS_ERR	     	   	    	 ((uint32_t)0x00000008)
#define MIL_STD_1553_STATUS_RCVA	            	 ((uint32_t)0x00000010)
#define MIL_STD_1553_STATUS_RCVB 	  	         	 ((uint32_t)0x00000020)

/** @} */ /* End of group MIL_STD_1553_STATUS */

/** @defgroup MDR1986VE8T_Periph_MIL_STD_1553_ERROR	MIL STD 1553 ERROR
  * @{
  */ 

/*-- MIL_STD_1553_ERROR: MIL_STD_1553 ERROR Register -----*/
/* Bit field positions: */
#define MIL_STD_1553_ERROR_NORCV_Pos           0
#define MIL_STD_1553_ERROR_MANERR_Pos          1
#define MIL_STD_1553_ERROR_SYNCERR_Pos         2
#define MIL_STD_1553_ERROR_SEQERR_Pos          3
#define MIL_STD_1553_ERROR_GAPERR_Pos          4
#define MIL_STD_1553_ERROR_CONERR_Pos          5
#define MIL_STD_1553_ERROR_PROERR_Pos          6

/* Bit field masks: */
#define MIL_STD_1553_ERROR_NORCV                ((uint32_t)0x00000001)
#define MIL_STD_1553_ERROR_MANERR               ((uint32_t)0x00000002)
#define MIL_STD_1553_ERROR_SYNCERR              ((uint32_t)0x00000004)
#define MIL_STD_1553_ERROR_SEQERR               ((uint32_t)0x00000008)
#define MIL_STD_1553_ERROR_GAPERR               ((uint32_t)0x00000010)
#define MIL_STD_1553_ERROR_CONERR               ((uint32_t)0x00000020)
#define MIL_STD_1553_ERROR_PROERR               ((uint32_t)0x00000040)

/** @} */ /* End of group MIL_STD_1553_ERROR */

