eldarkg/emdr1986x-std-per-lib/CMSIS/CM4/DeviceSupport/MDR32F8/inc/MDR1986VE8T.h
/** @defgroup MDR1986VE8T_Periph_ARINC492_CONTROL5	ARINC492 CONTROL5
  * @{
  */ 

/*-- ARINC492_CONTROL5: ARINC492 CONTROL5 Register -----*/
/* Bit field positions: */
#define ARINC429R_CONTROL5_DIV_CH5_Pos            	 0
#define ARINC429R_CONTROL5_DIV_CH6_Pos            	 8
#define ARINC429R_CONTROL5_DIV_CH7_Pos            	 16
#define ARINC429R_CONTROL5_DIV_CH8_Pos            	 24

/* Bit field masks: */
#define ARINC429R_CONTROL5_DIV_CH5_Msk               ((uint32_t)0x000000FF)
#define ARINC429R_CONTROL5_DIV_CH6_Msk               ((uint32_t)0x0000FF00)
#define ARINC429R_CONTROL5_DIV_CH7_Msk               ((uint32_t)0x00FF0000)
#define ARINC429R_CONTROL5_DIV_CH8_Msk				 ((uint32_t)0xFF000000)

/** @} */ /* End of group ARINC492_CONTROL5 */

/** @defgroup MDR1986VE8T_Periph_ARINC429R_INTMASK	ARINC429R INTMASK
  * @{
  */ 

/*-- ARINC429R_INTMASK: ARINC429R INTMASK register -----*/
/* Bit field positions: */
#define ARINC429R_INTMASK_IEHF1_Pos					0
#define ARINC429R_INTMASK_IEFF1_Pos					1
#define ARINC429R_INTMASK_IEER1_Pos					2
#define ARINC429R_INTMASK_IEDR1_Pos					3
#define ARINC429R_INTMASK_IEHF2_Pos					4
#define ARINC429R_INTMASK_IEFF2_Pos					5
#define ARINC429R_INTMASK_IEER2_Pos					6
#define ARINC429R_INTMASK_IEDR2_Pos					7
#define ARINC429R_INTMASK_IEHF3_Pos					8
#define ARINC429R_INTMASK_IEFF3_Pos					9
#define ARINC429R_INTMASK_IEER3_Pos					10
#define ARINC429R_INTMASK_IEDR3_Pos					11
#define ARINC429R_INTMASK_IEHF4_Pos					12
#define ARINC429R_INTMASK_IEFF4_Pos					13
#define ARINC429R_INTMASK_IEER4_Pos					14
#define ARINC429R_INTMASK_IEDR4_Pos					15
#define ARINC429R_INTMASK_IEHF5_Pos					16
#define ARINC429R_INTMASK_IEFF5_Pos					17
#define ARINC429R_INTMASK_IEER5_Pos					18
#define ARINC429R_INTMASK_IEDR5_Pos					19
#define ARINC429R_INTMASK_IEHF6_Pos					20
#define ARINC429R_INTMASK_IEFF6_Pos					21
#define ARINC429R_INTMASK_IEER6_Pos					22
#define ARINC429R_INTMASK_IEDR6_Pos					23
#define ARINC429R_INTMASK_IEHF7_Pos					24
#define ARINC429R_INTMASK_IEFF7_Pos					25
#define ARINC429R_INTMASK_IEER7_Pos					26
#define ARINC429R_INTMASK_IEDR7_Pos					27
#define ARINC429R_INTMASK_IEHF8_Pos					28
#define ARINC429R_INTMASK_IEFF8_Pos					29
#define ARINC429R_INTMASK_IEER8_Pos					30
#define ARINC429R_INTMASK_IEDR8_Pos					31

/* Bit field masks: */
#define ARINC429R_INTMASK_IEHF1						((uint32_t)0x00000001))
#define ARINC429R_INTMASK_IEFF1						((uint32_t)0x00000002))
#define ARINC429R_INTMASK_IEER1						((uint32_t)0x00000004))
#define ARINC429R_INTMASK_IEDR1						((uint32_t)0x00000008))
#define ARINC429R_INTMASK_IEHF2						((uint32_t)0x00000010))
#define ARINC429R_INTMASK_IEFF2						((uint32_t)0x00000020))
#define ARINC429R_INTMASK_IEER2						((uint32_t)0x00000040))
#define ARINC429R_INTMASK_IEDR2						((uint32_t)0x00000080))
#define ARINC429R_INTMASK_IEHF3						((uint32_t)0x00000100))
#define ARINC429R_INTMASK_IEFF3						((uint32_t)0x00000200))
#define ARINC429R_INTMASK_IEER3						((uint32_t)0x00000400))
#define ARINC429R_INTMASK_IEDR3						((uint32_t)0x00000800))
#define ARINC429R_INTMASK_IEHF4						((uint32_t)0x00001000))
#define ARINC429R_INTMASK_IEFF4						((uint32_t)0x00002000))
#define ARINC429R_INTMASK_IEER4						((uint32_t)0x00004000))
#define ARINC429R_INTMASK_IEDR4						((uint32_t)0x00008000))
#define ARINC429R_INTMASK_IEHF5						((uint32_t)0x00010000))
#define ARINC429R_INTMASK_IEFF5						((uint32_t)0x00020000))
#define ARINC429R_INTMASK_IEER5						((uint32_t)0x00040000))
#define ARINC429R_INTMASK_IEDR5						((uint32_t)0x00080000))
#define ARINC429R_INTMASK_IEHF6						((uint32_t)0x00100000))
#define ARINC429R_INTMASK_IEFF6						((uint32_t)0x00200000))
#define ARINC429R_INTMASK_IEER6						((uint32_t)0x00400000))
#define ARINC429R_INTMASK_IEDR6						((uint32_t)0x00800000))
#define ARINC429R_INTMASK_IEHF7						((uint32_t)0x01000000))
#define ARINC429R_INTMASK_IEFF7						((uint32_t)0x02000000))
#define ARINC429R_INTMASK_IEER7						((uint32_t)0x04000000))
#define ARINC429R_INTMASK_IEDR7						((uint32_t)0x08000000))
#define ARINC429R_INTMASK_IEHF8						((uint32_t)0x10000000))
#define ARINC429R_INTMASK_IEFF8						((uint32_t)0x20000000))
#define ARINC429R_INTMASK_IEER8						((uint32_t)0x40000000))
#define ARINC429R_INTMASK_IEDR8						((uint32_t)0x80000000))

/** @} */ /* End of group ARINC429R_INTMASK */

/** @defgroup MDR1986VE8T_Periph_ARINC429R_STATUS1	ARINC429R STATUS1
  * @{
  */ 

/*-- ARINC429R_STATUS1: ARINC429R STATUS1 Register -----*/
/* Bit field positions: */
#define ARINC429R_STATUS1_DR1_Pos              0
#define ARINC429R_STATUS1_DR2_Pos              1
#define ARINC429R_STATUS1_DR3_Pos              2
#define ARINC429R_STATUS1_DR4_Pos              3
#define ARINC429R_STATUS1_DR5_Pos              4
#define ARINC429R_STATUS1_DR6_Pos              5
#define ARINC429R_STATUS1_DR7_Pos              6
#define ARINC429R_STATUS1_DR8_Pos              7
#define ARINC429R_STATUS1_ERR1_Pos             14
#define ARINC429R_STATUS1_ERR2_Pos             15
#define ARINC429R_STATUS1_ERR3_Pos             16
#define ARINC429R_STATUS1_ERR4_Pos             17
#define ARINC429R_STATUS1_ERR5_Pos             18
#define ARINC429R_STATUS1_ERR6_Pos             19
#define ARINC429R_STATUS1_ERR7_Pos             20
#define ARINC429R_STATUS1_ERR8_Pos             21

/* Bit field masks: */
#define ARINC429R_STATUS1_DR1                   ((uint32_t)0x00000001)
#define ARINC429R_STATUS1_DR2                   ((uint32_t)0x00000002)
#define ARINC429R_STATUS1_DR3                   ((uint32_t)0x00000004)
#define ARINC429R_STATUS1_DR4                   ((uint32_t)0x00000008)
#define ARINC429R_STATUS1_DR5                   ((uint32_t)0x00000010)
#define ARINC429R_STATUS1_DR6                   ((uint32_t)0x00000020)
#define ARINC429R_STATUS1_DR7                   ((uint32_t)0x00000040)
#define ARINC429R_STATUS1_DR8                   ((uint32_t)0x00000080)
#define ARINC429R_STATUS1_ERR1                  ((uint32_t)0x00004000)
#define ARINC429R_STATUS1_ERR2                  ((uint32_t)0x00008000)
#define ARINC429R_STATUS1_ERR3                  ((uint32_t)0x00010000)
#define ARINC429R_STATUS1_ERR4                  ((uint32_t)0x00020000)
#define ARINC429R_STATUS1_ERR5                  ((uint32_t)0x00040000)
#define ARINC429R_STATUS1_ERR6                  ((uint32_t)0x00080000)
#define ARINC429R_STATUS1_ERR7                  ((uint32_t)0x00100000)
#define ARINC429R_STATUS1_ERR8                  ((uint32_t)0x00200000)

/** @} */ /* End of group ARINC429R_STATUS1 */

/** @defgroup MDR1986VE8T_Periph_ARINC429R_STATUS2	ARINC429R STATUS2
  * @{
  */ 

/*-- ARINC429R_STATUS2: ARINC429R STATUS2 Register -----*/
/* Bit field positions: */
#define ARINC429R_STATUS2_FF1_Pos              0
#define ARINC429R_STATUS2_FF2_Pos              1
#define ARINC429R_STATUS2_FF3_Pos              2
#define ARINC429R_STATUS2_FF4_Pos              3
#define ARINC429R_STATUS2_FF5_Pos              4
#define ARINC429R_STATUS2_FF6_Pos              5
#define ARINC429R_STATUS2_FF7_Pos              6
#define ARINC429R_STATUS2_FF8_Pos              7
#define ARINC429R_STATUS2_HF1_Pos              14
#define ARINC429R_STATUS2_HF2_Pos              15
#define ARINC429R_STATUS2_HF3_Pos              16
#define ARINC429R_STATUS2_HF4_Pos              17
#define ARINC429R_STATUS2_HF5_Pos              18
#define ARINC429R_STATUS2_HF6_Pos              19
#define ARINC429R_STATUS2_HF7_Pos              20
#define ARINC429R_STATUS2_HF8_Pos              21

/* Bit field masks: */
#define ARINC429R_STATUS2_FF1                   ((uint32_t)0x00000001)
#define ARINC429R_STATUS2_FF2                   ((uint32_t)0x00000002)
#define ARINC429R_STATUS2_FF3                   ((uint32_t)0x00000004)
#define ARINC429R_STATUS2_FF4                   ((uint32_t)0x00000008)
#define ARINC429R_STATUS2_FF5                   ((uint32_t)0x00000010)
#define ARINC429R_STATUS2_FF6                   ((uint32_t)0x00000020)
#define ARINC429R_STATUS2_FF7                   ((uint32_t)0x00000040)
#define ARINC429R_STATUS2_FF8                   ((uint32_t)0x00000080)
#define ARINC429R_STATUS2_HF1                   ((uint32_t)0x00004000)
#define ARINC429R_STATUS2_HF2                   ((uint32_t)0x00008000)
#define ARINC429R_STATUS2_HF3                   ((uint32_t)0x00010000)
#define ARINC429R_STATUS2_HF4                   ((uint32_t)0x00020000)
#define ARINC429R_STATUS2_HF5                   ((uint32_t)0x00040000)
#define ARINC429R_STATUS2_HF6                   ((uint32_t)0x00080000)
#define ARINC429R_STATUS2_HF7                   ((uint32_t)0x00100000)
#define ARINC429R_STATUS2_HF8                   ((uint32_t)0x00200000)

/** @} */ /* End of group ARINC429R_STATUS2 */

/** @} */ /* End of group MDR1986VE8T_Periph_ARINC429R_Defines */

