eldarkg/emdr1986x-std-per-lib/CMSIS/CM4/DeviceSupport/MDR32F8/inc/MDR1986VE8T.h
/***
*   CLOCK Control 
**/
typedef struct
{
  __IO	uint32_t KEY;
  __IO	uint32_t MAX_CLK;
  __IO	uint32_t CPU_CLK;
  __IO	uint32_t PER0_CLK;
  __IO	uint32_t PER1_CLK;
  
  __IO	uint32_t CPU_CHK0;
  __IO	uint32_t CPU_CHK1;
  __IO	uint32_t CPU_CHK2;
  __IO	uint32_t CPU_STAT;
  
  __IO	uint32_t LSI_CLK;
  __IO	uint32_t LSI_CHK0;
  __IO	uint32_t LSI_CHK1;
  __IO	uint32_t LSI_CHK2;
  __IO	uint32_t LSI_STAT;
  
  __IO	uint32_t HSI_STAT;
  
  __IO	uint32_t LSE_CLK;
  __IO	uint32_t LSE_CHK0;
  __IO	uint32_t LSE_CHK1;
  __IO	uint32_t LSE_CHK2;
  __IO	uint32_t LSE_STAT;
  
  __IO	uint32_t HSE0_CLK;
  __IO	uint32_t HSE0_CHK0;
  __IO	uint32_t HSE0_CHK1;
  __IO	uint32_t HSE0_CHK2;
  __IO	uint32_t HSE0_STAT;

  __IO	uint32_t HSE1_CLK;
  __IO	uint32_t HSE1_CHK0;
  __IO	uint32_t HSE1_CHK1;
  __IO	uint32_t HSE1_CHK2;
  __IO	uint32_t HSE1_STAT;
  
  __IO	uint32_t PLL0_CLK;
  __IO	uint32_t PLL0_CHK0;
  __IO	uint32_t PLL0_CHK1;
  __IO	uint32_t PLL0_CHK2;
  __IO	uint32_t PLL0_STAT;
  
  __IO	uint32_t PLL1_CLK;
  __IO	uint32_t PLL1_CHK0;
  __IO	uint32_t PLL1_CHK1;
  __IO	uint32_t PLL1_CHK2;
  __IO	uint32_t PLL1_STAT;
  
  __IO	uint32_t PLL2_CLK;
  __IO	uint32_t PLL2_CHK0;
  __IO	uint32_t PLL2_CHK1;
  __IO	uint32_t PLL2_CHK2;
  __IO	uint32_t PLL2_STAT;
  
  __IO	uint32_t PLL3_CLK;
  __IO	uint32_t PLL3_CHK0;
  __IO	uint32_t PLL3_CHK1;
  __IO	uint32_t PLL3_CHK2;
  __IO	uint32_t PLL3_STAT;
  
  __IO	uint32_t PLL4_CLK;
  __IO	uint32_t PLL4_CHK0;
  __IO	uint32_t PLL4_CHK1;
  __IO	uint32_t PLL4_CHK2;
  __IO	uint32_t PLL4_STAT;
  
  __IO	uint32_t PLL5_CLK;
  __IO	uint32_t PLL5_CHK0;
  __IO	uint32_t PLL5_CHK1;
  __IO	uint32_t PLL5_CHK2;
  __IO	uint32_t PLL5_STAT;
  
  __IO	uint32_t PLL6_CLK;
  __IO	uint32_t PLL6_CHK0;
  __IO	uint32_t PLL6_CHK1;
  __IO	uint32_t PLL6_CHK2;
  __IO	uint32_t PLL6_STAT;
  
  __IO	uint32_t PLL7_CLK;
  __IO	uint32_t PLL7_CHK0;
  __IO	uint32_t PLL7_CHK1;
  __IO	uint32_t PLL7_CHK2;
  __IO	uint32_t PLL7_STAT;
  
  __IO	uint32_t CAN0_CLK;
  __IO	uint32_t CAN1_CLK;
  __IO	uint32_t CAN2_CLK;
  __IO	uint32_t CAN3_CLK;
  __IO	uint32_t CAN4_CLK;
  __IO	uint32_t CAN5_CLK;

  __IO	uint32_t TIM0_CLK;
  __IO	uint32_t TIM1_CLK;
  __IO	uint32_t TIM2_CLK;
  __IO	uint32_t TIM3_CLK;
  __IO	uint32_t TIM4_CLK;
  __IO	uint32_t TIM5_CLK;


  __IO	uint32_t MIL0_CLK;
  __IO	uint32_t MIL1_CLK;
  __IO	uint32_t MIL2_CLK;
  __IO	uint32_t MIL3_CLK;
  
  __IO	uint32_t ARC0_CLK;
  __IO	uint32_t ARC1_CLK;
  __IO	uint32_t ARC2_CLK;
  __IO	uint32_t ARC3_CLK;
  
  __IO	uint32_t EMAC0_CLK;
  __IO	uint32_t EMAC1_CLK;
  __IO	uint32_t EPHY0_CLK;
  __IO	uint32_t EPHY1_CLK;
  
  __IO	uint32_t SPW0_CLK;
  __IO	uint32_t SPW1_CLK;
  __IO	uint32_t SPHY0_CLK;
  __IO	uint32_t SPHY1_CLK;
  
  __IO	uint32_t UART0_CLK;
  __IO	uint32_t UART1_CLK;
  __IO	uint32_t UART2_CLK;
  __IO	uint32_t UART3_CLK;
  __IO	uint32_t UART4_CLK;
  __IO	uint32_t UART5_CLK;
  
  __IO	uint32_t SSP0_CLK;
  __IO	uint32_t SSP1_CLK;
  __IO	uint32_t SSP2_CLK;
  __IO	uint32_t SSP3_CLK;
  __IO	uint32_t SSP4_CLK;
  __IO	uint32_t SSP5_CLK;
  
  __IO	uint32_t USB_CLK;
  
  __IO	uint32_t ADC0_CLK;
  __IO	uint32_t ADC1_CLK;
  
  __IO	uint32_t DAC0_CLK;
  __IO	uint32_t DAC1_CLK;
  
  __IO	uint32_t RTC_CLK;
  
} CLKControl;

#define CLK_CNTR_BASE	    (( uint32_t) 0x40000000)

#define	CLK_CNTR	    ((CLKControl *) CLK_CNTR_BASE)

/*
#define	BKP_BASE	    (( uint32_t) 0x040001000)
#define BKP_KEY 	    ((uint32_t)	0x8555aaa1)

*/

/** @defgroup Periph_RST_CLK_CAN_CLOCK	RST CLK CAN CLOCK
  * @{
  */ 

/*-- RST_CLK_CAN_CLOCK: CAN Clock Register -------------------------*/
/* Bit field positions: */
#define RST_CLK_CAN_CLOCK_CAN0_BRG_Pos          0
#define RST_CLK_CAN_CLOCK_CAN1_BRG_Pos          0
#define RST_CLK_CAN_CLOCK_CAN0_CLK_EN_Pos       16
#define RST_CLK_CAN_CLOCK_CAN1_CLK_EN_Pos       16

/* Bit field masks: */
#define RST_CLK_CAN_CLOCK_CAN0_BRG_Msk          ((uint32_t)0x0000FFFF)
#define RST_CLK_CAN_CLOCK_CAN1_BRG_Msk          ((uint32_t)0x0000FFFF)
#define RST_CLK_CAN_CLOCK_CAN0_CLK_EN           ((uint32_t)0x00010000)
#define RST_CLK_CAN_CLOCK_CAN1_CLK_EN           ((uint32_t)0x00010000)

/** @} */ /* End of group RST_CLK_CAN_CLOCK */

/** @defgroup Periph_RST_CLK_SSP_CLOCK	RST CLK SSP CLOCK
  * @{
  */ 

/*-- RST_CLK_SSP_CLOCK: SSP Clock Register -------------------------*/
/* Bit field positions: */
#define RST_CLK_SSP_CLOCK_SSP0_BRG_Pos          0
#define RST_CLK_SSP_CLOCK_SSP1_BRG_Pos          0
#define RST_CLK_SSP_CLOCK_SSP0_CLK_EN_Pos       16
#define RST_CLK_SSP_CLOCK_SSP1_CLK_EN_Pos       16

/* Bit field masks: */
#define RST_CLK_SSP_CLOCK_SSP0_BRG_Msk          ((uint32_t)0x0000FFFF)
#define RST_CLK_SSP_CLOCK_SSP1_BRG_Msk          ((uint32_t)0x0000FFFF)
#define RST_CLK_SSP_CLOCK_SSP0_CLK_EN           ((uint32_t)0x00010000)
#define RST_CLK_SSP_CLOCK_SSP1_CLK_EN           ((uint32_t)0x00010000)

/** @} */ /* End of group RST_CLK_SSP_CLOCK */

/** @defgroup Periph_RST_CLK_TIM_CLOCK	RST CLK TIM CLOCK
  * @{
  */ 

/*-- RST_CLK_TIM_CLOCK: Timer Clock Register -----------------------*/
/* Bit field positions: */
#define RST_CLK_TIM_CLOCK_TIM0_BRG_Pos          0
#define RST_CLK_TIM_CLOCK_TIM1_BRG_Pos          0
#define RST_CLK_TIM_CLOCK_TIM2_BRG_Pos          0
#define RST_CLK_TIM_CLOCK_TIM3_BRG_Pos          0
#define RST_CLK_TIM_CLOCK_TIM0_CLK_EN_Pos       16
#define RST_CLK_TIM_CLOCK_TIM1_CLK_EN_Pos       16
#define RST_CLK_TIM_CLOCK_TIM2_CLK_EN_Pos       16
#define RST_CLK_TIM_CLOCK_TIM3_CLK_EN_Pos       16

/* Bit field masks: */
#define RST_CLK_TIM_CLOCK_TIM0_BRG_Msk          ((uint32_t)0x0000FFFF)
#define RST_CLK_TIM_CLOCK_TIM1_BRG_Msk          ((uint32_t)0x0000FFFF)
#define RST_CLK_TIM_CLOCK_TIM2_BRG_Msk          ((uint32_t)0x0000FFFF)
#define RST_CLK_TIM_CLOCK_TIM3_BRG_Msk          ((uint32_t)0x0000FFFF)
#define RST_CLK_TIM_CLOCK_TIM0_CLK_EN           ((uint32_t)0x00010000)
#define RST_CLK_TIM_CLOCK_TIM1_CLK_EN           ((uint32_t)0x00010000)
#define RST_CLK_TIM_CLOCK_TIM2_CLK_EN           ((uint32_t)0x00010000)
#define RST_CLK_TIM_CLOCK_TIM3_CLK_EN           ((uint32_t)0x00010000)

/** @} */ /* End of group RST_CLK_TIM_CLOCK */

/** @defgroup MDR1986VE8T_Periph_RST_CLK_ETR_CLOCK	RST CLK ETR CLOCK
  * @{
  */ 

/*-- RST_CLK_ETR_CLOCK: ETR Clock Register -----------------------*/
/* Bit field positions: */
#define RST_CLK_ETH_CLOCK_ETH_BRG_Pos				0
#define RST_CLK_ETH_CLOCK_MAN_BRG_Pos				0	 //notused
#define RST_CLK_ETH_CLOCK_PHY_BRG_Pos				0
#define RST_CLK_ETH_CLOCK_ETH_CLK_EN_Pos		16
#define RST_CLK_ETH_CLOCK_MAN_CLK_EN_Pos		0	 //notused
#define RST_CLK_ETH_CLOCK_SLEEP_Pos					0  //notused
#define RST_CLK_ETH_CLOCK_PHY_CLK_EN_Pos		16
#define RST_CLK_ETH_CLOCK_PHY_CLK_SEL_Pos		0  //notused
#define RST_CLK_ETH_CLOCK_ETH2_CLK_EN_Pos		0  //notused

/* Bit field masks: */

#define RST_CLK_ETH_CLOCK_MAN_BRG_Msk			((uint32_t)0x00000000)//notused
#define RST_CLK_ETH_CLOCK_MAN_CLK_EN			((uint32_t)0x00000000)//notused
#define RST_CLK_ETH_CLOCK_SLEEP					  ((uint32_t)0x00000000)//notused

#define RST_CLK_ETH_CLOCK_ETH_BRG_Msk			((uint32_t)0x0000FFFF)
#define RST_CLK_ETH_CLOCK_ETH_CLK_EN			((uint32_t)0x00010000)

#define RST_CLK_ETH_CLOCK_PHY_CLK_EN			((uint32_t)0x00010000)
#define RST_CLK_ETH_CLOCK_PHY_CLK_SEL_Msk	((uint32_t)0x00000000)//notused
#define RST_CLK_ETH_CLOCK_PHY_BRG_Msk			((uint32_t)0x0000FFFF)

#define RST_CLK_ETH_CLOCK_ETH2_CLK_EN			((uint32_t)0x00000000)//notused

/** @} */ /* End of group RST_CLK_ETR_CLOCK */

