eldarkg/emdr1986x-std-per-lib/CMSIS/CM4/DeviceSupport/MDR32F8/inc/MDR1986VE8T.h
/***
*  PORT control
**/

typedef struct
{
  __IO	uint32_t KEY;
  __IO	uint32_t RXTX;
  __IO	uint32_t SRXTX;
  __IO	uint32_t CRXTX;
  
  __IO	uint32_t SOE;
  __IO	uint32_t COE;

  __IO	uint32_t SFUNC[4];

  __IO	uint32_t CFUNC[4];
  
  __IO	uint32_t SANALOG;
  __IO	uint32_t CANALOG;
  
  __IO	uint32_t SPULLUP;
  __IO	uint32_t CPULLUP;
  
  __IO	uint32_t SPULLDOWN;
  __IO	uint32_t CPULLDOWN;

  __IO	uint32_t SPD;
  __IO	uint32_t CPD;

  __IO	uint32_t SPWR[2];
  __IO	uint32_t CPWR[2];

  __IO	uint32_t SCL;
  __IO	uint32_t CCL;

  __IO	uint32_t SIE;
  __IO	uint32_t CIE;

  __IO	uint32_t SIT;
  __IO	uint32_t CIT;
  
  __IO	uint32_t SIR;
  __IO	uint32_t CIR; 

  __IO	uint32_t HCUR; 
 
} PortControl;



#define PORTA_BASE	    (( uint32_t) 0x40080000)
#define PORTB_BASE	    (( uint32_t) 0x40081000)
#define PORTC_BASE	    (( uint32_t) 0x40082000)
#define PORTD_BASE	    (( uint32_t) 0x40083000)
#define PORTE_BASE	    (( uint32_t) 0x40084000)
#define PORTF_BASE	    (( uint32_t) 0x40085000)

#define	PORTA	    	    ((PortControl *) PORTA_BASE)
#define	PORTB	    	    ((PortControl *) PORTB_BASE)
#define	PORTC	    	    ((PortControl *) PORTC_BASE)
#define	PORTD	    	    ((PortControl *) PORTD_BASE)
#define	PORTE	    	    ((PortControl *) PORTE_BASE)
#define	PORTF	    	    ((PortControl *) PORTF_BASE)

#define FUNC_MASK 0x0f
#define FUNCREGNUM(pin)	(pin >> 3)
#define _FUNCPIN(TYPE) TYPE ## FUNC
#define FUNCPIN(pin,TYPE) _FUNCPIN(TYPE)[FUNCREGNUM(pin)]
#define SFUNCPIN(pin) FUNCPIN(pin,S)
#define CFUNCPIN(pin) FUNCPIN(pin,C)
#define FUNCVAL(pin,func) ((func & FUNC_MASK) << ((pin % 8)<<2))

#define PWR_MASK 0x3
#define PWRREGNUM(pin) (pin >> 4)
#define _PWRPIN(type) type ## PWR
#define PWRPIN(pin, type) _PWRPIN(type)[PWRREGNUM(pin)]
#define SPWRPIN(pin) PWRPIN(pin, S)
#define CPWRPIN(pin) PWRPIN(pin, C)
#define PWRVAL(pin, pwr) ((pwr & PWR_MASK) << ((pin % 16) << 1))

/****
/ USB controller interface
**/
typedef struct
{
  __IO uint32_t HTXC;
  __IO uint32_t HTXT;
  __IO uint32_t HTXLC;
  __IO uint32_t HTXSE;
  __IO uint32_t HTXA;
  __IO uint32_t HTXE;
  __IO uint32_t HFN_L;
  __IO uint32_t HFN_H;
  __IO uint32_t HIS;
  __IO uint32_t HIM;
  __IO uint32_t HRXS;
  __IO uint32_t HRXP;
  __IO uint32_t HRXA;
  __IO uint32_t HRXE;
  __IO uint32_t HRXCS;
  __IO uint32_t HSTM;
  __IO uint32_t RESERVED1[16];
  __IO uint32_t HRXFD;
  __IO uint32_t RESERVED2;
  __IO uint32_t HRXFDC_L;
  __IO uint32_t HRXFDC_H;
  __IO uint32_t HRXFC;
  __IO uint32_t RESERVED3[11];
  __IO uint32_t HTXFD;
  __IO uint32_t RESERVED4[3];
  __IO uint32_t HTXFDC;
  __IO uint32_t RESERVED5[11];

  __IO uint32_t SEP0_CTRL;
  __IO uint32_t SEP0_STS;
  __IO uint32_t SEP0_TS;
  __IO uint32_t SEP0_NTS;
  __IO uint32_t SEP1_CTRL;
  __IO uint32_t SEP1_STS;
  __IO uint32_t SEP1_TS;
  __IO uint32_t SEP1_NTS;
  __IO uint32_t SEP2_CTRL;
  __IO uint32_t SEP2_STS;
  __IO uint32_t SEP2_TS;
  __IO uint32_t SEP2_NTS;
  __IO uint32_t SEP3_CTRL;
  __IO uint32_t SEP3_STS;
  __IO uint32_t SEP3_TS;
  __IO uint32_t SEP3_NTS;
  __IO uint32_t SC;
  __IO uint32_t SLS;
  __IO uint32_t SIS;
  __IO uint32_t SIM;
  __IO uint32_t SA;
  __IO uint32_t SFN_L;
  __IO uint32_t SFN_H;
  __IO uint32_t RESERVED6[9];
 
  __IO uint32_t SEP0_RXFD;
  __IO uint32_t RESERVED7;
  __IO uint32_t SEP0_RXFDC_L;
  __IO uint32_t SEP0_RXFDC_H;
  __IO uint32_t SEP0_RXFC;
  __IO uint32_t RESERVED8[11];
  __IO uint32_t SEP0_TXFD;
  __IO uint32_t RESERVED9[3];
  __IO uint32_t SEP0_TXFDC;
  __IO uint32_t RESERVED10[11];
  __IO uint32_t SEP1_RXFD;
  __IO uint32_t RESERVED11;
  __IO uint32_t SEP1_RXFDC_L;
  __IO uint32_t SEP1_RXFDC_H;
  __IO uint32_t SEP1_RXFC;
  __IO uint32_t RESERVED12[11];
  __IO uint32_t SEP1_TXFD;
  __IO uint32_t RESERVED13[3];
  __IO uint32_t SEP1_TXFDC;
  __IO uint32_t RESERVED14[11];
  __IO uint32_t SEP2_RXFD;
  __IO uint32_t RESERVED15;
  __IO uint32_t SEP2_RXFDC_L;
  __IO uint32_t SEP2_RXFDC_H;
  __IO uint32_t SEP2_RXFC;
  __IO uint32_t RESERVED16[11];
  __IO uint32_t SEP2_TXFD;
  __IO uint32_t RESERVED17[3];
  __IO uint32_t SEP2_TXFDC;
  __IO uint32_t RESERVED18[11];
  __IO uint32_t SEP3_RXFD;
  __IO uint32_t RESERVED19;
  __IO uint32_t SEP3_RXFDC_L;
  __IO uint32_t SEP3_RXFDC_H;
  __IO uint32_t SEP3_RXFC;
  __IO uint32_t RESERVED20[11];
  __IO uint32_t SEP3_TXFD;
  __IO uint32_t RESERVED21[3];
  __IO uint32_t SEP3_TXFDC;
  __IO uint32_t RESERVED22[11];
  
  __IO uint32_t HSCR;
  __IO uint32_t HSVR;
}
USB_Typedef;

#define USB_BASE	0x4009D000
#define USB		((USB_Typedef *) USB_BASE)

/***
*  TIMER32 control
**/
typedef struct
{
  __IO	uint32_t CNT;
  __IO	uint32_t PSG;
  __IO	uint32_t ARR;
  __IO	uint32_t CNTRL;
  __IO	uint32_t CCR1;
  __IO	uint32_t CCR2;
  __IO	uint32_t CCR3;
  __IO	uint32_t CCR4;
  __IO	uint32_t CH1_CNTRL;
  __IO	uint32_t CH2_CNTRL;
  __IO	uint32_t CH3_CNTRL;
  __IO	uint32_t CH4_CNTRL;
  __IO	uint32_t CH1_CNTRL1;
  __IO	uint32_t CH2_CNTRL1;
  __IO	uint32_t CH3_CNTRL1;
  __IO	uint32_t CH4_CNTRL1;
  __IO	uint32_t CH1_DTG;
  __IO	uint32_t CH2_DTG;
  __IO	uint32_t CH3_DTG;
  __IO	uint32_t CH4_DTG;
  __IO	uint32_t BRKETR_CNTRL;
  __IO	uint32_t STATUS;
  __IO	uint32_t IE;
  __IO	uint32_t DMA_RE;
  __IO	uint32_t CH1_CNTRL2;
  __IO	uint32_t CH2_CNTRL2;
  __IO	uint32_t CH3_CNTRL2;
  __IO	uint32_t CH4_CNTRL2;
  __IO	uint32_t CCR11;
  __IO	uint32_t CCR21;
  __IO	uint32_t CCR31;
  __IO	uint32_t CCR41;
  __IO	uint32_t DMA_RECh1;
  __IO	uint32_t DMA_RECh2;
  __IO	uint32_t DMA_RECh3;
  __IO	uint32_t DMA_RECh4;
  
  
}MDR_TMR_TypeDef;

#define MDR_TMR_BASE                 (PERIPH_BASE + 0x80000)

#define MDR_TMR0_BASE		  (MDR_TMR_BASE + 0xA000)
#define MDR_TMR1_BASE		  (MDR_TMR_BASE + 0xB000)
#define MDR_TMR2_BASE		  (MDR_TMR_BASE + 0xC000)
#define MDR_TMR3_BASE		  (MDR_TMR_BASE + 0xD000)
#define MDR_TMR4_BASE		  (MDR_TMR_BASE + 0xE000)
#define MDR_TMR5_BASE		  (MDR_TMR_BASE + 0xF000)

#define MDR_TMR0                     ((MDR_TMR_TypeDef *) MDR_TMR0_BASE)
#define MDR_TMR1                     ((MDR_TMR_TypeDef *) MDR_TMR1_BASE)
#define MDR_TMR2                     ((MDR_TMR_TypeDef *) MDR_TMR2_BASE)
#define MDR_TMR3                     ((MDR_TMR_TypeDef *) MDR_TMR3_BASE)
#define MDR_TMR4                     ((MDR_TMR_TypeDef *) MDR_TMR4_BASE)
#define MDR_TMR5                     ((MDR_TMR_TypeDef *) MDR_TMR5_BASE)

/** @defgroup MDR1986VE8T_Periph_TIMER_Defines Defines
  * @{
  */

/** @defgroup Periph_TIMER_CNTRL	TIMER CNTRL
  * @{
  */ 

/*-- TIMER_CNTRL: Timer Control Register ---------------------------*/
/* Bit field positions: */
#define TIMER_CNTRL_CNT_EN_Pos                  0
#define TIMER_CNTRL_ARRB_EN_Pos                 1
#define TIMER_CNTRL_WR_CMPL_Pos                 2
#define TIMER_CNTRL_DIR_Pos                     3
#define TIMER_CNTRL_FDTS_Pos                    4
#define TIMER_CNTRL_CNT_MODE_Pos                6
#define TIMER_CNTRL_EVENT_SEL_Pos               8

/* Bit field masks: */
#define TIMER_CNTRL_CNT_EN                      ((uint32_t)0x00000001)
#define TIMER_CNTRL_ARRB_EN                     ((uint32_t)0x00000002)
#define TIMER_CNTRL_WR_CMPL                     ((uint32_t)0x00000004)
#define TIMER_CNTRL_DIR                         ((uint32_t)0x00000008)
#define TIMER_CNTRL_FDTS_Msk                    ((uint32_t)0x00000030)
#define TIMER_CNTRL_CNT_MODE_Msk                ((uint32_t)0x000000C0)
#define TIMER_CNTRL_EVENT_SEL_Msk               ((uint32_t)0x00000F00)

/** @} */ /* End of group TIMER_CNTRL */

/** @defgroup Periph_TIMER_CH_CNTRL	TIMER CH CNTRL
  * @{
  */ 

/*-- TIMER_CH_CNTRL: Timer Channel Control Register ----------------*/
/* Bit field positions: */
#define TIMER_CH_CNTRL_CHFLTR_Pos               0
#define TIMER_CH_CNTRL_CHSEL_Pos                4
#define TIMER_CH_CNTRL_CHPSC_Pos                6
#define TIMER_CH_CNTRL_OCCE_Pos                 8
#define TIMER_CH_CNTRL_OCCM_Pos                 9
#define TIMER_CH_CNTRL_BRKEN_Pos                12
#define TIMER_CH_CNTRL_ETREN_Pos                13
#define TIMER_CH_CNTRL_WR_CMPL_Pos              14
#define TIMER_CH_CNTRL_CAP_NPWM_Pos             15

/* Bit field masks: */
#define TIMER_CH_CNTRL_CHFLTR_Msk               ((uint32_t)0x0000000F)
#define TIMER_CH_CNTRL_CHSEL_Msk                ((uint32_t)0x00000030)
#define TIMER_CH_CNTRL_CHPSC_Msk                ((uint32_t)0x000000C0)
#define TIMER_CH_CNTRL_OCCE                     ((uint32_t)0x00000100)
#define TIMER_CH_CNTRL_OCCM_Msk                 ((uint32_t)0x00000E00)
#define TIMER_CH_CNTRL_BRKEN                    ((uint32_t)0x00001000)
#define TIMER_CH_CNTRL_ETREN                    ((uint32_t)0x00002000)
#define TIMER_CH_CNTRL_WR_CMPL                  ((uint32_t)0x00004000)
#define TIMER_CH_CNTRL_CAP_NPWM                 ((uint32_t)0x00008000)

/** @} */ /* End of group TIMER_CH_CNTRL */

/** @defgroup Periph_TIMER_CH_CNTRL1	TIMER CH CNTRL1
  * @{
  */ 

/*-- TIMER_CH_CNTRL1: Timer Channel Control1 Register --------------*/
/* Bit field positions: */
#define TIMER_CH_CNTRL1_SELOE_Pos               0
#define TIMER_CH_CNTRL1_SELO_Pos                2
#define TIMER_CH_CNTRL1_INV_Pos                 4
#define TIMER_CH_CNTRL1_NSELOE_Pos              8
#define TIMER_CH_CNTRL1_NSELO_Pos               10
#define TIMER_CH_CNTRL1_NINV_Pos                12

/* Bit field masks: */
#define TIMER_CH_CNTRL1_SELOE_Msk               ((uint32_t)0x00000003)
#define TIMER_CH_CNTRL1_SELO_Msk                ((uint32_t)0x0000000C)
#define TIMER_CH_CNTRL1_INV                     ((uint32_t)0x00000010)
#define TIMER_CH_CNTRL1_NSELOE_Msk              ((uint32_t)0x00000300)
#define TIMER_CH_CNTRL1_NSELO_Msk               ((uint32_t)0x00000C00)
#define TIMER_CH_CNTRL1_NINV                    ((uint32_t)0x00001000)

/** @} */ /* End of group TIMER_CH_CNTRL1 */

/** @defgroup Periph_TIMER_CH_DTG	TIMER CH DTG
  * @{
  */ 

/*-- TIMER_CH_DTG: Timer Channel DTG Register ----------------------*/
/* Bit field positions: */
#define TIMER_CH_DTGX_Pos                       0
#define TIMER_CH_DTG_EDTS_Pos                   4
#define TIMER_CH_DTG_Pos                        8

/* Bit field masks: */
#define TIMER_CH_DTGX_Msk                       ((uint32_t)0x0000000F)
#define TIMER_CH_DTG_EDTS                       ((uint32_t)0x00000010)
#define TIMER_CH_DTG_Msk                        ((uint32_t)0x0000FF00)

/** @} */ /* End of group TIMER_CH_DTG */

