eldarkg/emdr1986x-std-per-lib/CMSIS/CM4/DeviceSupport/MDR32F8/inc/MDR1986VE8T.h
/*-- SSP_IMSC: SSP Interrupt Mask Register -------------------------*/
/* Bit field positions: */
#define SSP_IMSC_RORIM_Pos                      0
#define SSP_IMSC_RTIM_Pos                       1
#define SSP_IMSC_RXIM_Pos                       2
#define SSP_IMSC_TXIM_Pos                       3

/* Bit field masks: */
#define SSP_IMSC_RORIM                          ((uint32_t)0x00000001)
#define SSP_IMSC_RTIM                           ((uint32_t)0x00000002)
#define SSP_IMSC_RXIM                           ((uint32_t)0x00000004)
#define SSP_IMSC_TXIM                           ((uint32_t)0x00000008)

/** @} */ /* End of group SSP_IMSC */

/** @defgroup Periph_SSP_RIS	SSP RIS
  * @{
  */ 

/*-- SSP_RIS: SSP Interrupt Pending Register -----------------------*/
/* Bit field positions: */
#define SSP_RIS_RORRIS_Pos                      0
#define SSP_RIS_RTRIS_Pos                       1
#define SSP_RIS_RXRIS_Pos                       2
#define SSP_RIS_TXRIS_Pos                       3

/* Bit field masks: */
#define SSP_RIS_RORRIS                          ((uint32_t)0x00000001)
#define SSP_RIS_RTRIS                           ((uint32_t)0x00000002)
#define SSP_RIS_RXRIS                           ((uint32_t)0x00000004)
#define SSP_RIS_TXRIS                           ((uint32_t)0x00000008)

/** @} */ /* End of group SSP_RIS */

/** @defgroup Periph_SSP_MIS	SSP MIS
  * @{
  */ 

/*-- SSP_MIS: SSP Masked Interrupt Pending Register ----------------*/
/* Bit field positions: */
#define SSP_MIS_RORMIS_Pos                      0
#define SSP_MIS_RTMIS_Pos                       1
#define SSP_MIS_RXMIS_Pos                       2
#define SSP_MIS_TXMIS_Pos                       3

/* Bit field masks: */
#define SSP_MIS_RORMIS                          ((uint32_t)0x00000001)
#define SSP_MIS_RTMIS                           ((uint32_t)0x00000002)
#define SSP_MIS_RXMIS                           ((uint32_t)0x00000004)
#define SSP_MIS_TXMIS                           ((uint32_t)0x00000008)

/** @} */ /* End of group SSP_MIS */

/** @defgroup Periph_SSP_ICR	SSP ICR
  * @{
  */ 

/*-- SSP_ICR: SSP Interrupt Clear Register -------------------------*/
/* Bit field positions: */
#define SSP_ICR_RORIC_Pos                       0
#define SSP_ICR_RTIC_Pos                        1

/* Bit field masks: */
#define SSP_ICR_RORIC                           ((uint32_t)0x00000001)
#define SSP_ICR_RTIC                            ((uint32_t)0x00000002)

/** @} */ /* End of group SSP_ICR */

/** @defgroup Periph_SSP_DMACR	SSP DMACR
  * @{
  */ 

/*-- SSP_DMACR: SSP DMA Control Register ---------------------------*/
/* Bit field positions: */
#define SSP_DMACR_RXDMAE_Pos                    0
#define SSP_DMACR_TXDMAE_Pos                    1

/* Bit field masks: */
#define SSP_DMACR_RXDMAE                        ((uint32_t)0x00000001)
#define SSP_DMACR_TXDMAE                        ((uint32_t)0x00000002)

/** @} */ /* End of group SSP_DMACR */

/** @} */ /* End of group MDR1986VE8T_Periph_SSP_Defines */


/***
*  MDR_UART control
**/
typedef struct
{
  __IO	uint32_t DR;
  __IO	uint32_t RSR_ECR;
  __IO	uint32_t Reserved1[4];
  __IO	uint32_t FR;
  __IO	uint32_t Reserved2;
  __IO	uint32_t ILPR;
  __IO	uint32_t IBRD;
  __IO	uint32_t FBRD;
  __IO	uint32_t LCR_H;
  __IO	uint32_t CR;
  __IO	uint32_t IFLS;
  __IO	uint32_t IMSC;
  __IO	uint32_t RIS;
  __IO	uint32_t MIS;
  __IO	uint32_t ICR;
  __IO	uint32_t DMACR;
}MDR_UART_TypeDef;

#define MDR_UART_BASE                 (PERIPH_BASE + 0x90000)

#define MDR_UART0_BASE		  (MDR_UART_BASE + 0x9000)//0x9000
#define MDR_UART1_BASE		  (MDR_UART_BASE + 0xA000)
#define MDR_UART2_BASE		  (MDR_UART_BASE + 0xB000)
#define MDR_UART3_BASE		  (MDR_UART_BASE + 0xC000)

#define MDR_UART0                     ((MDR_UART_TypeDef *) MDR_UART0_BASE)
#define MDR_UART1                     ((MDR_UART_TypeDef *) MDR_UART1_BASE)
#define MDR_UART2                     ((MDR_UART_TypeDef *) MDR_UART2_BASE)
#define MDR_UART3                     ((MDR_UART_TypeDef *) MDR_UART3_BASE)


/***
*  MDR_SPW control
**/
typedef struct
{
  __IO	uint32_t CONTROL;
  __IO	uint32_t STATUS;
  __IO	uint32_t DIV;
  __IO	uint32_t TIME;
  __IO	uint32_t PAUSE;
  __IO	uint32_t FIFORX;
  __IO	uint32_t FIFOTX;
  __IO	uint32_t CNTRX_PACK;
  __IO	uint32_t CNTRX0_PACK;
  __IO	uint32_t NUM_TXDESC;
  __IO	uint32_t NUM_RXDESC;
  __IO	uint32_t PHY_CNTR;
  __IO	uint32_t RESERV[4];
  __IO	uint32_t RXDESC[16];
  __IO	uint32_t TXDESC[16];
}MDR_SPW_TypeDef;

#define MDR_SPW_BASE                 (PERIPH_BASE + 0x80000)

#define MDR_SPW0_BASE		  (MDR_SPW_BASE + 0x8000)
#define MDR_SPW1_BASE		  (MDR_SPW_BASE + 0x9000)

#define MDR_SPW0                     ((MDR_SPW_TypeDef *) MDR_SPW0_BASE)
#define MDR_SPW1                     ((MDR_SPW_TypeDef *) MDR_SPW1_BASE)

/***
*  MDR_ETH control
**/

typedef struct
{
  __IO	uint16_t DILIMETR;
  __IO	uint16_t MAC_T;
  __IO	uint16_t MAC_M;
  __IO	uint16_t MAC_H;
  __IO	uint16_t HASH0;
  __IO	uint16_t HASH1;
  __IO	uint16_t HASH2;
  __IO	uint16_t HASH3;
  __IO	uint16_t IPG;
  __IO	uint16_t PSC;
  __IO	uint16_t BAG;
  __IO	uint16_t JITTERWND;
  __IO	uint16_t R_CFG;
  __IO	uint16_t X_CFG;
//  __IO	uint32_t G_CFG;
	__IO	uint16_t G_CFGl;
	__IO	uint16_t G_CFGh;
  __IO	uint16_t IMR;
  __IO	uint16_t IFR;
  __IO	uint16_t MDIO_CTRL;
  __IO	uint16_t MDIO_DATA;
  __IO	uint16_t R_HEAD;
  __IO	uint16_t X_TAIL;
  __IO	uint16_t R_TAIL;
  __IO	uint16_t X_HEAD;
  __IO	uint16_t STAT;
  __IO	uint16_t RCOUNTER;
  __IO	uint16_t PHY_CONTROL;
  __IO	uint16_t PHY_STATUS;
  __IO	uint16_t PHY_CNTR_A;
}MDR_ETH_TypeDef;


#define MDR_ETH_BASE                 (SRAM_BASE + 0x1000000)

#define MDR_ETH0_BASE		  (MDR_ETH_BASE + 0x00000)
#define MDR_ETH1_BASE		  (MDR_ETH_BASE + 0x10000)

#define MDR_ETH0                     ((MDR_ETH_TypeDef *) MDR_ETH0_BASE)
#define MDR_ETH1                     ((MDR_ETH_TypeDef *) MDR_ETH1_BASE)


/** @defgroup MDR1986VE8T_Periph_ETHERNET_Defines Defines
  * @{
  */

/** @defgroup MDR1986VE8T_Periph_ETH_G_CFGl	ETH G CFGl
  * @{
  */ 

/*-- ETH_G_CFGl: ETH G_CFGl Register -----*/
/* Bit field positions: */
#define ETH_G_CFGl_ColWnd_Pos          		0
#define ETH_G_CFGl_PAUSE_EN_Pos       		8
#define ETH_G_CFGl_DTRM_EN_Pos         		9
#define ETH_G_CFGl_HD_EN_Pos          		10
#define ETH_G_CFGl_EXT_EN_Pos          		11
#define ETH_G_CFGl_BUFF_MODE_Pos       		12
#define ETH_G_CFGl_RCLR_EN_Pos         		14

/* Bit field masks: */
#define ETH_G_CFGl_ColWnd_Msk           	((uint32_t)0x000000FF)
#define ETH_G_CFGl_PAUSE_EN             	((uint32_t)0x00000100)
#define ETH_G_CFGl_DTRM_EN              	((uint32_t)0x00000200)
#define ETH_G_CFGl_HD_EN 	         	 	((uint32_t)0x00000400)
#define ETH_G_CFGl_EXT_EN               	((uint32_t)0x00000800)
#define ETH_G_CFGl_BUFF_MODE_Msk        	((uint32_t)0x00003000)
#define ETH_G_CFGl_EN_RCLR             	 	((uint32_t)0x00004000)

