eldarkg/emdr1986x-std-per-lib/CMSIS/CM4/DeviceSupport/MDR32F8/inc/MDR1986VE8T.h
/** @} */ /* End of group ETH_IFR */

/** @defgroup MDR1986VE8T_Periph_ETH_STAT	ETH STAT
  * @{
  */ 

/*-- ETH_STAT: ETH STAT Register -----*/
/* Bit field positions: */
#define ETH_STAT_R_EMPTY_Pos			0
#define ETH_STAT_R_AEMPTY_Pos			1
#define ETH_STAT_R_HALF_Pos				2
#define ETH_STAT_R_AFULL_Pos			3
#define ETH_STAT_R_FULL_Pos				4
#define ETH_STAT_R_COUNT_Pos			5
#define ETH_STAT_X_EMPTY_Pos			8
#define ETH_STAT_X_AEMPTY_Pos			9
#define ETH_STAT_X_HALF_Pos				10
#define ETH_STAT_X_AFULL_Pos			11
#define ETH_STAT_X_FULL_Pos				12

/* Bit field masks: */
#define ETH_STAT_R_EMPTY				((uint32_t)0x00000001)
#define ETH_STAT_R_AEMPTY				((uint32_t)0x00000002)
#define ETH_STAT_R_HALF					((uint32_t)0x00000004)
#define ETH_STAT_R_AFULL				((uint32_t)0x00000008)
#define ETH_STAT_R_FULL					((uint32_t)0x00000010)
#define ETH_STAT_R_COUNT_Msk			((uint32_t)0x000000E0)
#define ETH_STAT_X_EMPTY				((uint32_t)0x00000100)
#define ETH_STAT_X_AEMPTY				((uint32_t)0x00000200)
#define ETH_STAT_X_HALF					((uint32_t)0x00000400)
#define ETH_STAT_X_AFULL				((uint32_t)0x00000800)
#define ETH_STAT_X_FULL					((uint32_t)0x00001000)

/** @} */ /* End of group ETH_STAT */

/** @defgroup MDR1986VE8T_Periph_ETH_MDIO_CTRL	ETH MDIO CTRL
  * @{
  */ 

/*-- ETH_MDIO_CTRL: ETH MDIO_CTRL Register -----*/
/* Bit field positions: */
#define ETH_MDIO_CTRL_RG_A_Pos			0
#define ETH_MDIO_CTRL_DIV_Pos			5
#define ETH_MDIO_CTRL_PHY_A_Pos			8
#define ETH_MDIO_CTRL_OP_Pos			13
#define ETH_MDIO_CTRL_PRE_EN_Pos		14
#define ETH_MDIO_CTRL_RDY_Pos			15

/* Bit field masks: */
#define ETH_MDIO_CTRL_RG_A_Msk			((uint32_t)0x0000001F)
#define ETH_MDIO_CTRL_DIV_Msk			((uint32_t)0x000000E0)
#define ETH_MDIO_CTRL_PHY_A_Msk			((uint32_t)0x00001F00)
#define ETH_MDIO_CTRL_OP				((uint32_t)0x00002000)
#define ETH_MDIO_CTRL_PRE_EN			((uint32_t)0x00004000)
#define ETH_MDIO_CTRL_RDY				((uint32_t)0x00008000)

/** @} */ /* End of group ETH_MDIO_CTRL */

/** @defgroup MDR1986VE8T_Periph_ETH_PHY_CONTROL	ETH PHY CONTROL
  * @{
  */ 

/*-- ETH_PHY_CONTROL: ETH PHY_CONTROL Register -----*/
/* Bit field positions: */
#define ETH_PHY_CONTROL_LB_pos						0
#define ETH_PHY_CONTROL_DLB_pos						1
#define ETH_PHY_CONTROL_HALFD_pos					2
#define ETH_PHY_CONTROL_EARLY_DV_pos			3
#define ETH_PHY_CONTROL_DIR_pos						4
#define ETH_PHY_CONTROL_BASE_2_pos				5
#define ETH_PHY_CONTROL_LINK_PERIOD_pos		6
#define ETH_PHY_CONTROL_EXT_EN_pos				14
#define ETH_PHY_CONTROL_RST_pos						15

/* Bit field masks: */
#define ETH_PHY_CONTROL_LB						((uint32_t)0x00000001)
#define ETH_PHY_CONTROL_DLB						((uint32_t)0x00000002)
#define ETH_PHY_CONTROL_HALFD					((uint32_t)0x00000004)
#define ETH_PHY_CONTROL_EARLY_DV			((uint32_t)0x00000008)
#define ETH_PHY_CONTROL_DIR						((uint32_t)0x00000010)
#define ETH_PHY_CONTROL_BASE_2				((uint32_t)0x00000020)
#define ETH_PHY_CONTROL_LINK_PERIOD		((uint32_t)0x00000FC0)
#define ETH_PHY_CONTROL_EXT_EN				((uint32_t)0x00004000)
#define ETH_PHY_CONTROL_RST						((uint32_t)0x00008000)

/** @} */ /* End of group ETH_PHY_CONTROL */

/** @defgroup MDR1986VE8T_Periph_ETH_PHY_STATUS	ETH PHY STATUS
  * @{
  */ 

/*-- ETH_PHY_STATUS: ETH PHY_STATUS Register -----*/
/* Bit field positions: */
#define ETH_PHY_STATUS_LED_LINK_pos			8
#define ETH_PHY_STATUS_LED_STAT_pos			9
#define ETH_PHY_STATUS_INT_LOSS_pos			10
#define ETH_PHY_STATUS_INT_POL_pos			11
#define ETH_PHY_STATUS_INT_JAB_pos			12
#define ETH_PHY_STATUS_INT_JAM_pos			13

/* Bit field masks: */
#define ETH_PHY_STATUS_LED_LINK			((uint32_t)0x00000100)
#define ETH_PHY_STATUS_LED_STAT			((uint32_t)0x00000200)
#define ETH_PHY_STATUS_INT_LOSS			((uint32_t)0x00000400)
#define ETH_PHY_STATUS_INT_POL			((uint32_t)0x00000800)
#define ETH_PHY_STATUS_INT_JAB			((uint32_t)0x00001000)
#define ETH_PHY_STATUS_INT_JAM			((uint32_t)0x00002000)

/** @} */ /* End of group ETH_PHY_STATUS */

/*-- ETH_PHY_STATUS: ETH PHY_CONTROL_A Register -----*/
/* Bit field positions: */
#define ETH_PHY_CONTROL_A_SELR_pos			0
#define ETH_PHY_CONTROL_A_TRIM_pos			1
#define ETH_PHY_CONTROL_A_TRIMR_pos			4
#define ETH_PHY_CONTROL_A_EN_PHY_pos		15

/* Bit field masks: */
#define ETH_PHY_CONTROL_A_SELR					((uint32_t)0x00000001)
#define ETH_PHY_CONTROL_A_TRIM					((uint32_t)0x0000000E)
#define ETH_PHY_CONTROL_A_TRIMR					((uint32_t)0x00000FF0)
#define ETH_PHY_CONTROL_A_EN_PHY				((uint32_t)0x00008000)

/** @} */ /* End of group ETH_PHY_STATUS */

/** @} */ /* End of group MDR1986VE8T_Periph_ETHERNET Defines */

/******************************************************************************/
/*                         Peripheral memory map                              */
/******************************************************************************/
/* Peripheral and SRAM base address */
#define SRAM_BASE             ((     uint32_t)0x20000000)
#define PERIPH_BASE           ((     uint32_t)0x40000000)
#define PERIPH_BB_BASE        ((     uint32_t)0x42000000)

/* Peripheral memory map */
#define GPIO_BASE                 (PERIPH_BASE + 0x0e000)

#define GPIO0_BASE                (GPIO_BASE)
#define GPIO1_BASE                (GPIO_BASE       + 0x0800)
#define GPIO2_BASE                (GPIO_BASE       + 0x1000)

#define SMPID		  ((volatile uint32_t) *((uint32_t *)0xe00fe000))
#define SMPID_BASE	      ((uint32_t) 0xe00fe000)
/******************************************************************************/
/*                         Peripheral declaration                             */
/******************************************************************************/
#define GPIO0                     ((GPIO_TypeDef *) GPIO0_BASE)
#define GPIO1                     ((GPIO_TypeDef *) GPIO1_BASE)
#define GPIO2                     ((GPIO_TypeDef *) GPIO2_BASE)


#endif



